[
	{
		"name": "Akita",
		"description": "Akitas são cães corpulentos, de ossatura pesada, do tipo spitz, de estatura imponente. Medindo de 24 a 28 polegadas na altura dos ombros, os Akitas têm uma pelagem densa que vem em várias cores, inclusive branco. A cabeça é larga e maciça, equilibrada na parte traseira por uma cauda cheia e enrolada. As orelhas eretas e os olhos escuros e brilhantes contribuem para uma expressão de alerta, uma marca registrada da raça. Os Akitas são cães quietos e meticulosos. Desconfie de estranhos e muitas vezes intolerante com outros animais, os Akitas terão prazer em compartilhar seu lado bobo e afetuoso com familiares e amigos. Eles prosperam na companhia humana. O grande e independente Akita está programado para proteger aqueles que ama. Devem ser bem socializados desde o nascimento com pessoas e outros cães. Akitas são cães musculosos e de pelagem dupla, de antiga linhagem japonesa, famosos por sua dignidade, coragem e lealdade. Em sua terra natal, são venerados como protetores da família e símbolos de boa saúde, felicidade e vida longa.",
		"popularity": 47,
		"min_height": 60.96,
		"max_height": 71.12,
		"min_weight": 31.75,
		"max_weight": 58.97,
		"min_expectancy": 10.00,
		"max_expectancy": 13.00,
		"embbeding": [0.80, 0.60, 0.80, 1.00, 0.60]
	},
	{
		"name": "Boiadeiro-australiano",
		"description": "Medindo entre 17 e 20 polegadas no ombro, o Boiadeiro-australiano é um pastor robusto e musculoso, com força e agilidade. O ACD nasce com uma pelagem branca que fica azul acinzentada ou vermelha. Ambas as variedades de pelagem apresentam padrões distintos de manchas ou manchas. Os ACDs têm imenso impulso para o trabalho e são excelentes na caça, perseguição e, claro, na movimentação de gado. Sua energia ilimitada e marcha flexível os tornam excelentes parceiros de corrida. Os ACDs são leais, notoriamente inteligentes, sempre alertas e cautelosos com estranhos. Se um ACD não for desafiado, ele facilmente fica entediado e faz travessuras. É recomendado que os proprietários de ACD participem com seus cães de algum trabalho, esporte ou exercício regular para mantê-lo em boa forma física e mental. O compacto mas musculoso Australian Cattle Dog, também chamado Blue Heeler ou Queensland Heeler, está relacionado ao famoso cão selvagem da Austrália, o Dingo. Esses pastores resilientes são inteligentes o suficiente para superar seus donos rotineiramente.",
		"popularity": 55,
		"min_height": 43.18,
		"max_height": 50.80,
		"min_weight": 15.88,
		"max_weight": 22.68,
		"min_expectancy": 12.00,
		"max_expectancy": 16.00,
		"embbeding": [0.20, 0.80, 1.00, 0.20, 0.40]
	},
	{
		"name": "Pastor Australiano",
		"description": "O pastor australiano, o cão pastor preferido do cowboy, é um trabalhador de tamanho médio com um olhar aguçado e penetrante. Os casacos australianos oferecem looks diferentes, incluindo merle (um padrão manchado com tons contrastantes de azul ou vermelho). Em todos os sentidos, eles são a imagem de movimentadores de estoque robustos e ágeis. Os australianos exibem um impulso irresistível de pastorear qualquer coisa: pássaros, cachorros, crianças. Esse forte impulso para o trabalho pode tornar os australianos cães demais para um dono de animal sedentário. Os australianos são extremamente inteligentes, capazes de enganar um proprietário novato desavisado. Resumindo, este não é o animal de estimação para todos. Mas se você está procurando um parceiro inteligente, incansável e treinável para trabalho ou esporte, sua busca pode terminar aqui. O pastor australiano, um cão de fazenda magro e resistente, é uma daquelas histórias “só na América”: uma raça europeia aperfeiçoada na Califórnia, passando pela Austrália. Presentes no circuito de rodeio, estão intimamente associados à vida do cowboy.",
		"popularity": 17,
		"min_height": 45.72,
		"max_height": 58.42,
		"min_weight": 18.14,
		"max_weight": 29.48,
		"min_expectancy": 12.00,
		"max_expectancy": 15.00,
		"embbeding": [0.40, 0.60, 0.80, 1.00, 0.60]
	},
	{
		"name": "Basset Hound",
		"description": "O Basset Hound não tem mais de 14 polegadas no ombro, mas, com seus ossos notavelmente pesados, perninhas poderosas e patas enormes, ele possui força e resistência de cachorro grande. Os bassets são famosos por uma cabeça grande e abaulada que apresenta orelhas extremamente longas e aveludadas, olhos tristes e sobrancelhas enrugadas, que dão à raça a aparência de um palhaço triste. Construído mais para resistência do que para velocidade, o Basset se move de maneira deliberada, mas sem esforço. A capacidade olfativa da raça é incrível; diz-se que entre os cães apenas o nariz do Bloodhound é mais preciso. Gentil e agradável em casa, o Basset é teimoso na trilha e late em voz alta e retumbante. Embora possam não ser muito demonstrativos em suas afeições, eles são firmemente leais. Entre as raças mais atraentes do AKC, o cativante e instantaneamente reconhecível Basset Hound é um eterno favorito dos amantes de cães em todo o mundo. Este cão discreto e discreto às vezes pode ser teimoso, mas é sempre charmoso.",
		"popularity": 39,
		"min_height": 38.10,
		"max_height": 38.10,
		"min_weight": 18.14,
		"max_weight": 29.48,
		"min_expectancy": 12.00,
		"max_expectancy": 13.00,
		"embbeding": [0.60, 0.40, 0.20, 0.40, 0.80]
	},
	{
		"name": "Beagle",
		"description": "Existem duas variedades de Beagle: aquelas que medem menos de 33 centímetros no ombro e aquelas entre 33 e 45 centímetros. Ambas as variedades são robustas, sólidas e “grandes para seus centímetros”, como dizem os caninos. Eles vêm em cores agradáveis ​​como limão, vermelho e branco e tricolor. A fortuna do Beagle está em seu rosto adorável, com grandes olhos castanhos ou castanhos realçados por orelhas longas e arredondadas, inseridas baixas em uma cabeça larga. Uma raça descrita como “alegre” por seus criadores, os Beagles são amorosos e amáveis, felizes e sociáveis ​​– todas as qualidades que os tornam excelentes cães de família. Não é de admirar que durante anos o Beagle tenha sido o cão de caça mais popular entre os donos de animais de estimação americanos. São cães curiosos, inteligentes e enérgicos que precisam de muito tempo para brincar. O Beagle não é apenas um excelente cão de caça e um companheiro leal, mas também é despreocupado, engraçado e – graças à sua expressão suplicante – fofo. Eles foram criados para caçar em matilhas, por isso gostam de companhia e geralmente são tranquilos.",
		"popularity": 6,
		"min_height": 33.02,
		"max_height": 38.10,
		"min_weight": 5.90,
		"max_weight": 13.61,
		"min_expectancy": 10.00,
		"max_expectancy": 15.00,
		"embbeding": [0.60, 0.60, 0.80, 0.60, 0.80]
	},
	{
		"name": "Collie Barbudo",
		"description": "Com 50 a 55 centímetros de altura nos ombros e coberto da cabeça à cauda com um casaco duplo felpudo, os Beardies têm uma semelhança passageira com outro favorito britânico, o Old English Sheepdog. Por baixo dos casacos, os Beardies são os mais magros e angulosos dos dois. Os luxuosos pelos faciais não devem obscurecer a expressão característica: um olhar sonhador e distante. Esses quadrinhos indisciplinados podem ser um punhado, mas principalmente, os Beardies têm aproximadamente 50 quilos de coração, energia e risadas. Beardies bem socializados se darão bem com outros animais e crianças. Eles ficam entediados facilmente e o treinamento deve ser mantido interessante. Famílias que gostam de atividades ao ar livre e procuram um cão robusto para compartilhar um estilo de vida agitado nunca encontrarão um companheiro mais afetuoso e divertido. Um cão de condução barulhento e carismático da Escócia, o Bearded Collie de pêlo peludo (“Beardie” para seus amigos) gosta de exercícios ao ar livre em qualquer clima. Criados para serem tomadores de decisão independentes, eles podem ser obstinados, mas são sempre amigáveis.",
		"popularity": 127,
		"min_height": 50.80,
		"max_height": 55.88,
		"min_weight": 20.41,
		"max_weight": 24.95,
		"min_expectancy": 12.00,
		"max_expectancy": 14.00,
		"embbeding": [0.80, 0.60, 0.60, 0.40, 1.00]
	},
	{
		"name": "Bichon Frisé",
		"description": "Um Bichon de bom tamanho terá uma sombra de trinta centímetros de altura no ombro. A glória da raça é uma pelagem branca hipoalergênica, felpuda e aveludada ao toque, com pelos arredondados que realçam os olhos grandes e escuros e a pele preta do nariz e dos lábios. Os bichons são companheiros adaptáveis ​​​​que se dão bem com outros cães e crianças. . Alertas e curiosos, os Bichons são pequenos cães de guarda, mas são amantes, não lutadores, e agem sob a suposição de que não existem estranhos, apenas amigos que ainda não conheceram. Sua confiança e tamanho os tornam cães urbanos ideais. Os Bichons treinam bem e gostam de se apresentar para seus entes queridos. Por fim, há a personalidade despreocupada do Bichon que atrai sorrisos e abraços onde quer que vá. O pequeno, mas robusto e resistente Bichon Frise está entre os grandes “cães de personalidade” do mundo. Desde a antiguidade, esses irresistíveis comediantes caninos contam com charme, beleza e inteligência para enfrentar os altos e baixos da história.",
		"popularity": 46,
		"min_height": 24.13,
		"max_height": 29.21,
		"min_weight": 5.44,
		"max_weight": 8.16,
		"min_expectancy": 14.00,
		"max_expectancy": 15.00,
		"embbeding": [1.00, 0.20, 0.60, 0.60, 1.00]
	},
	{
		"name": "Border collie",
		"description": "Borders são pastores atléticos de tamanho médio, medindo de 18 a 22 polegadas no ombro. A aparência geral é a de um trabalhador musculoso, mas ágil, intocado pelas modas passageiras. Tanto a pelagem áspera quanto a lisa vêm em uma variedade de cores e padrões. Os olhos amendoados são o foco de uma expressão inteligente - um olhar intenso, o famoso “olho de pastoreio” do Border, é uma marca registrada da raça. Em movimento, Borders está entre os cidadãos mais ágeis, equilibrados e duráveis ​​do reino canino. A inteligência, capacidade atlética e capacidade de treinamento de Borders são uma válvula de escape perfeita no treinamento de agilidade. Ter um trabalho para realizar, como agilidade – ou trabalho de pastoreio ou obediência – é a chave para a felicidade da Fronteira. Amáveis ​​entre amigos, podem ser reservados com estranhos. Um workaholic notavelmente brilhante, o Border Collie é um cão incrível - talvez um pouco incrível demais para proprietários sem tempo, energia ou meios para mantê-lo ocupado. Esses cães enérgicos se acomodarão para abraçar quando o dia de trabalho terminar.",
		"popularity": 35,
		"min_height": 45.72,
		"max_height": 55.88,
		"min_weight": 13.61,
		"max_weight": 24.95,
		"min_expectancy": 12.00,
		"max_expectancy": 15.00,
		"embbeding": [0.60, 0.60, 1.00, 1.00, 0.40]
	},
	{
		"name": "Borzoi",
		"description": "Borzoi são galgos grandes e elegantes. Um homem maduro mede pelo menos 28 polegadas no ombro e pesa de 75 a 105 libras. As fêmeas serão menores. Por baixo do luxuoso casaco sedoso, a construção do Borzoi segue o antigo modelo Greyhound. Antes conhecidos como Wolfhound Russo, os Borzoi foram criados para serem rápidos e fortes o suficiente para perseguir e prender sua feroz presa de tremoços. Em seu jeito quieto e felino, eles podem ser teimosos, e o treinamento é melhor realizado com paciência, consistência e bom humor. Cães de família afetuosos, os Borzoi são, no entanto, um pouco dignos demais para desfrutar de muita violência de todo o coração. A visão de um gato ou esquilo correndo irá rapidamente despertar seu instinto de perseguição, e uma sala de corrida cercada é obrigatória. Entre os cães mais impressionantemente belos, o aristocrático Borzoi é apreciado por seu temperamento calmo e agradável. A todo vapor, ele é um pacote principesco de força, graça e glamour voando a 35 a 40 milhas por hora.",
		"popularity": 103,
		"min_height": 66.04,
		"max_height": 71.12,
		"min_weight": 27.22,
		"max_weight": 47.63,
		"min_expectancy": 9.00,
		"max_expectancy": 14.00,
		"embbeding": [0.40, 0.60, 0.80, 0.40, 0.60]
	},
	{
		"name": "Boxer",
		"description": "Um Boxer bem feito e em ótimas condições é uma visão incrível. Um homem pode ter até 25 polegadas de altura no ombro; as fêmeas são menores. Seus músculos ondulam sob um casaco curto e justo. Os olhos castanhos escuros e a testa enrugada conferem ao rosto uma aparência alerta e curiosa. A pelagem pode ser fulva ou tigrada, com manchas brancas. Os boxeadores se movem como os atletas que deram seu nome: suaves e graciosos, com um poderoso impulso para a frente. Os boxeadores são otimistas e brincalhões. Sua paciência e natureza protetora conquistaram-lhes a reputação de serem ótimos cães com crianças. Eles levam a sério o trabalho de cão de guarda e guardião da família e enfrentarão ameaças sem medo. Os boxeadores se dão melhor quando expostos a muitas pessoas e outros animais desde a infância. Lealdade, carinho, inteligência, ética de trabalho e boa aparência: os boxeadores são o pacote completo para cães. Brilhante e alerta, às vezes bobo, mas sempre corajoso, o Boxer está entre as raças de cães mais populares da América há muito tempo.",
		"popularity": 11,
		"min_height": 54.61,
		"max_height": 63.50,
		"min_weight": 6.80,
		"max_weight": 36.29,
		"min_expectancy": 10.00,
		"max_expectancy": 12.00,
		"embbeding": [0.40, 0.40, 0.80, 0.80, 1.00]
	},
	{
		"name": "Bull terrier",
		"description": "Bull Terriers são terriers robustos e de ossos grandes que se movem com passos alegres, sugerindo agilidade e poder. A marca registrada da raça é uma cabeça longa e oval com orelhas eretas e pontudas e olhos pequenos e triangulares que brilham de bom humor. Os casacos vêm em dois tipos: brancos; e qualquer outra cor (incluindo listras tigradas atraentes), sólida ou com manchas brancas. Um BT bem feito é a imagem da determinação e do equilíbrio muscular. Existem quatro chaves para a felicidade da BT: socialização precoce com cães e pessoas; treinamento firme, mas amoroso; amplo exercício; e muito tempo de qualidade com seus adorados humanos. Se esses requisitos forem atendidos, não haverá companheiro mais leal, amável e divertido. Esta é a “raça de personalidade” definitiva. Entre os cidadãos mais cômicos e travessos do dogdom, o Bull Terrier é brincalhão e cativante, às vezes teimoso, mas sempre dedicado. Esses “cabeças de ovo” únicos são companheiros exuberantes e musculosos que prosperam com carinho e exercícios.",
		"popularity": 62,
		"min_height": 53.34,
		"max_height": 55.88,
		"min_weight": 22.68,
		"max_weight": 31.75,
		"min_expectancy": 12.00,
		"max_expectancy": 13.00,
		"embbeding": [0.40, 0.60, 0.80, 0.40, 0.80]
	},
	{
		"name": "Buldogue",
		"description": "Você não pode confundir um Bulldog com qualquer outra raça. A pele solta da cabeça, a testa franzida, o nariz arrebitado, as orelhas pequenas, o prognatismo inferior com costeletas pendentes de cada lado e o andar característico e ondulante praticamente gritam “Eu sou um Bulldog!” A pelagem, vista em uma variedade de cores e padrões, é curta, lisa e brilhante. Bulldogs podem pesar até 50 quilos, mas isso não os impedirá de se enrolarem em seu colo, ou pelo menos de tentarem. Mas não confunda seu jeito descontraído com preguiça – os Bulldogs gostam de caminhadas rápidas e precisam de exercícios moderados regulares, juntamente com uma dieta cuidadosa, para se manterem em forma. As tardes de verão são melhor passadas em uma sala com ar-condicionado, pois o focinho curto do Bulldog pode causar dificuldade para respirar em climas quentes e úmidos. Gentil, mas corajoso, amigável, mas digno, o Bulldog é um brutamontes corpulento, baixo e musculoso, cujo rosto “azedo” é o símbolo universal de coragem e tenacidade. Esses companheiros dóceis e leais adaptam-se bem à cidade ou ao campo.",
		"popularity": 5,
		"min_height": 35.56,
		"max_height": 38.10,
		"min_weight": 18.14,
		"max_weight": 22.68,
		"min_expectancy": 8.00,
		"max_expectancy": 10.00,
		"embbeding": [0.60, 0.80, 0.60, 0.60, 0.80]
	},
	{
		"name": "Bullmastife",
		"description": "O Bullmastiff não é tão grande quanto seu primo próximo, o Mastiff. Ainda assim, medindo até 27 polegadas no ombro e pesando entre 100 e 130 libras, este ainda é um cachorro enorme. Após a primeira impressão causada pelo tamanho do Bullmastiff, é a cabeça grande e larga que transmite a essência da raça: os olhos escuros, as orelhas altas em formato de V e o focinho largo e profundo se combinam para apresentar a inteligência, o estado de alerta e confiança que fazem do Bullmastiff um protetor de classe mundial e companheiro de família. Os casacos vêm em fulvo, vermelho ou tigrado. Essas são criaturas dóceis e confiáveis, mas, como acontece com qualquer cão de guarda grande, os donos devem começar o treinamento e a socialização cedo, enquanto o filhote ainda é pequeno o suficiente para ser controlado. Destemido no trabalho, dócil em casa, o Bullmastiff é um guarda grande e musculoso que perseguiu e manteve caçadores furtivos na Feliz Velha Inglaterra – alegre, supomos, para todos, menos para os caçadores furtivos. Bullmastiffs são o resultado de cruzamentos de Bulldog e Mastiff.",
		"popularity": 51,
		"min_height": 60.96,
		"max_height": 68.58,
		"min_weight": 45.36,
		"max_weight": 58.97,
		"min_expectancy": 7.00,
		"max_expectancy": 9.00,
		"embbeding": [0.20, 0.60, 0.80, 0.60, 0.60]
	},
	{
		"name": "Cairn Terrier",
		"description": "As qualidades únicas do Cairn, chamadas de “Cairnishness”, incluem uma cabeça curta e larga e um corpo livre e de pernas curtas que exala força, mas não peso, atingindo cerca de 25 centímetros de altura e cerca de 35 centímetros de comprimento. A pelagem dupla é áspera e dura na parte superior e felpuda na parte inferior. Um Cairn se apresenta como um cão pequeno, peludo e alerta, com cabeça, cauda e orelhas levantadas e olhos brilhando de inteligência. Um clube de raça britânico promove Cairns como o “melhor amiguinho do mundo”. Cairns são pequenos o suficiente para serem aconchegados no laptop e resistentes o suficiente para uma boa brincadeira no gramado. Eles se dão melhor com muito contato familiar próximo. Para proprietários que apreciam as qualidades do terrier de jogo, pensamento independente e lealdade verdadeira, nenhuma outra raça servirá. Cairn Terriers são pequenos cães terrestres felizes e ocupados, originalmente criados para destemidamente erradicar raposas e outras presas pequenas e peludas no interior rochoso da Escócia. Curiosos e alertas, Cairns gostam de ter um lugar onde possam explorar e cavar.",
		"popularity": 69,
		"min_height": 24.13,
		"max_height": 25.40,
		"min_weight": 5.90,
		"max_weight": 6.35,
		"min_expectancy": 13.00,
		"max_expectancy": 15.00,
		"embbeding": [0.40, 0.40, 0.60, 0.60, 0.80]
	},
	{
		"name": "Cane corso",
		"description": "Com quase 28 centímetros de altura nos ombros e muitas vezes pesando mais de 45 quilos, com uma cabeça grande, expressão alerta e músculos ondulando sob sua pelagem curta e rígida, os Corsi são criaturas intimidantes à primeira vista. Sua aparência imponente é a primeira linha de defesa contra intrusos. Como disse um escritor: “Um ar discreto de competência fria, o tipo de comportamento que você esperaria de um guarda-costas profissional, é a marca registrada da raça”. Os Corsi são inteligentes, leais, ansiosos por agradar, versáteis e intensamente leais aos seus humanos, mas também são assertivos e obstinados, e podem acabar possuindo um dono involuntário. Tal como acontece com qualquer outro grande cão de guarda, a criação responsável e a socialização precoce com pessoas e outros cães são vitais. Inteligente, treinável e de porte nobre, o assertivo e confiante Cane Corso é um protetor incomparável. A linhagem do Corso remonta aos tempos da Roma Antiga, e o nome da raça pode ser traduzido aproximadamente do latim como “cão guarda-costas”.",
		"popularity": 32,
		"min_height": 59.69,
		"max_height": 69.85,
		"min_expectancy": 9.00,
		"max_expectancy": 12.00,
		"embbeding": [0.00, 0.00, 0.20, 0.40, 0.80, 0.60, 0.60]
	},
	{
		"name": "Cavalier King Charles Spaniel",
		"description": "A beleza geral, a graça régia e até mesmo o temperamento do Cavalier o marcam como um dos nobres do reino canino. Um spaniel de brinquedo com não mais de 30 centímetros de altura, o Cavalier atrai você com seu rosto: a expressão doce, gentil e derretida que emana de olhos grandes e redondos é uma marca registrada da raça. Outra é a pelagem sedosa e de cores ricas, que pode ser uma das quatro variedades distintas. Os cavaleiros podem ser aristocratas, mas descem alegremente de seu cavalo real para uma brincadeira no quintal ou uma caça ao esquilo. Eles se dão muito bem com crianças e outros cães. Cavaliers adaptáveis ​​se dão igualmente bem com proprietários ativos e pessoas caseiras - eles podem ser atletas otimistas ou viciados em televisão desavergonhados, dependendo do estilo de vida do proprietário. O Cavalier King Charles Spaniel carrega sua conexão com a história britânica no nome de sua raça. Cavaliers são o melhor de dois mundos, combinando a atenção gentil de uma raça de brinquedo com a energia e capacidade atlética de um spaniel esportivo.",
		"popularity": 18,
		"min_height": 30.48,
		"max_height": 33.02,
		"min_weight": 5.90,
		"max_weight": 8.16,
		"min_expectancy": 12.00,
		"max_expectancy": 15.00,
		"embbeding": [0.40, 0.40, 0.40, 1.00, 0.80]
	},
	{
		"name": "Chihuahua",
		"description": "O Chihuahua é um cão equilibrado e gracioso, com comportamento semelhante ao de um terrier, pesando não mais que 3 quilos. A cabeça arredondada de “maçã” é uma marca registrada da raça. As orelhas eretas e os olhos cheios e luminosos são extremamente expressivos. Os casacos vêm em várias cores e padrões e podem ser longos ou curtos. As variedades são idênticas, exceto pela pelagem. Os chihuahuas possuem lealdade, charme e atitude de cachorro grande. Até mesmo cães pequenos precisam de treinamento e, sem ele, esse patife inteligente governará sua casa como um pequeno Napoleão. Compactos e confiantes, os chihuahuas são animais de estimação ideais para a cidade. Eles são pequenos demais para brigar com crianças e devem ser tomados cuidados especiais em climas frios, mas os chihuahuas são adaptáveis ​​– desde que tenham muito tempo de qualidade em seu colo preferido. O Chihuahua é um cachorrinho com uma personalidade enorme. Símbolo nacional do México, estes alertas e divertidos “cães de bolsa” estão entre as raças mais antigas das Américas, com uma linhagem que remonta aos antigos reinos dos tempos pré-colombianos.",
		"popularity": 33,
		"min_height": 12.70,
		"max_height": 20.32,
		"min_weight": 2.72,
		"max_weight": 2.72,
		"min_expectancy": 14.00,
		"max_expectancy": 16.00,
		"embbeding": [0.20, 0.40, 0.60, 0.40, 0.60]
	},
	{
		"name": "Chow chow",
		"description": "Chows são cães poderosos e de constituição compacta, com até 50 centímetros de altura no ombro. Seus traços distintivos incluem uma juba de leão ao redor da cabeça e dos ombros; uma língua preto-azulada; olhos amendoados profundos que contribuem para uma expressão carrancuda e esnobe; e uma marcha com pernas rígidas. Os chows podem ter pelagens ásperas ou lisas em vermelho, preto, azul, canela ou creme. Os proprietários dizem que os chows são os cães mais limpos: eles invadem a casa com facilidade, têm pouco odor de cachorro e são conhecidos por serem tão meticulosos quanto os gatos. Chows bem socializados nunca são ferozes ou intratáveis, mas sempre refinados e dignos. Eles são indiferentes a estranhos e eternamente leais aos entes queridos. Serenos e adaptáveis, sem necessidades especiais de exercícios, os Chows aceitam alegremente a vida na cidade. O Chow Chow, um cão versátil da China antiga, apresenta a imagem de um aristocrata musculoso e de peito largo com um ar de inescrutável atemporalidade. Digno, sério e indiferente, o Chow Chow é uma raça de delícias únicas.",
		"popularity": 75,
		"min_height": 43.18,
		"max_height": 50.80,
		"min_weight": 20.41,
		"max_weight": 31.75,
		"min_expectancy": 8.00,
		"max_expectancy": 12.00,
		"embbeding": [0.60, 0.60, 0.60, 0.20, 0.40]
	},
	{
		"name": "Cocker spaniel",
		"description": "Aqueles olhos grandes e escuros; aquela expressão doce; aquelas orelhas longas e exuberantes que praticamente exigem ser tocadas – não admira que o Cocker tenha passado anos como a raça mais popular da América. O Cocker é o menor spaniel esportivo do AKC, medindo cerca de 14 a 15 polegadas. O casaco vem em cores e padrões suficientes para agradar a qualquer gosto. O corpo bem equilibrado é robusto e sólido, e esses gundogs rápidos e duráveis ​​se movem com um andar suave e fácil. Os Cockers são companheiros de brincadeiras ávidos para crianças e são facilmente treinados como companheiros e atletas. Eles são grandes o suficiente para serem esportivos, mas compactos o suficiente para serem portáteis. Um Cocker com pelagem completa recompensa o tempo extra de preparação por ser o cachorro mais bonito do bairro. Esses cães esportivos enérgicos adoram brincar e caminhadas rápidas. O alegre e brincalhão Cocker Spaniel, com seus olhos grandes e sonhadores e personalidade travessa, é uma das raças mais amadas do mundo. Eles foram desenvolvidos como cães de caça, mas os Cockers ganharam grande popularidade como companheiros versáteis.",
		"popularity": 30,
		"min_height": 34.29,
		"max_height": 39.37,
		"min_weight": 9.07,
		"max_weight": 13.61,
		"min_expectancy": 10.00,
		"max_expectancy": 14.00,
		"embbeding": [0.80, 0.40, 0.60, 1.00, 1.00]
	},
	{
		"name": "Collie",
		"description": "O Collie é um pastor grande, mas ágil, medindo entre 22 e 26 polegadas de altura. A variedade áspera possui uma das pelagens mais impressionantemente vistosas do reino canino; os encantos da pelagem lisa são mais sutis, mas não menos satisfatórios. As cores da pelagem em ambas as variedades são zibelina e branca, tricolor, azul merle ou branco. Os criadores de Collie se orgulham da elegante cabeça em forma de cunha de sua raça, cujas orelhas móveis e olhos amendoados transmitem uma grande variedade de expressões. Os Collies são famosos por gostar de crianças e são animais de estimação maravilhosos para a família. Esses cães rápidos e atléticos prosperam com companheirismo e exercícios regulares. Com um treinamento suave, eles aprendem com alegria e rapidez. A lealdade, a inteligência e o excelente caráter do Collie são lendários. O majestoso Collie, graças a cem anos como estrela da cultura pop, está entre as raças de cães mais reconhecidas e amadas do mundo. O Collie “áspero” totalmente revestido é a variedade mais familiar, mas também existe um Collie “liso” elegante.",
		"popularity": 38,
		"min_height": 55.88,
		"max_height": 66.04,
		"min_weight": 22.68,
		"max_weight": 34.02,
		"min_expectancy": 12.00,
		"max_expectancy": 14.00,
		"embbeding": [0.60, 0.60, 0.60, 0.80, 0.80]
	},
	{
		"name": "Dachshund",
		"description": "A palavra “ícone” é terrivelmente sobrecarregada, mas o Dachshund – com seu inconfundível corpo de costas longas, perninhas e grande personalidade – é realmente um ícone do dogmatismo de raça pura. Os Dachshunds podem ser de tamanho padrão (geralmente de 16 a 32 libras) ou miniatura (11 libras ou menos) e vêm em um dos três tipos de pelagem: lisa, de pêlo duro ou de pêlo comprido. natação extenuante, mas fora isso esses cães incansáveis ​​estão prontos para qualquer coisa. Inteligentes e vigilantes, com um latido de cachorro grande, eles são ótimos cães de guarda. Criados para serem caçadores independentes de presas perigosas, eles podem ser corajosos ao ponto da imprudência e um pouco teimosos, mas sua natureza cativante e aparência única conquistaram milhões de corações em todo o mundo. A famosa silhueta longa e baixa, a expressão sempre alerta e a personalidade ousada e vivaz do Dachshund fizeram dele uma estrela do reino canino. Os Dachshunds vêm em dois tamanhos e três tipos de pelagem de várias cores e padrões.",
		"popularity": 12,
		"min_height": 12.70,
		"max_height": 22.86,
		"min_weight": 4.99,
		"max_weight": 14.51,
		"min_expectancy": 12.00,
		"max_expectancy": 16.00,
		"embbeding": [0.40, 0.40, 0.60, 0.60, 0.60]
	},
	{
		"name": "Pinscher Doberman",
		"description": "Os dobermans são cães de constituição compacta – musculosos, rápidos e poderosos – medindo entre 24 e 28 polegadas no ombro. O corpo é elegante, mas substancial, e é coberto por uma camada brilhante de preto, azul, vermelho ou fulvo, com marcas de ferrugem. Essas qualidades elegantes, combinadas com uma cabeça nobre em formato de cunha e uma maneira fácil e atlética de se mover, deram aos Dobermans a reputação de realeza no reino canino. Um Doberman bem condicionado em patrulha deterá todos, exceto o intruso mais tolo. Elegante e poderoso, possuindo um físico magnífico e uma inteligência aguçada, o Doberman Pinscher é um dos nobres da raça canina. Esta raça incomparavelmente destemida e vigilante está orgulhosamente entre os melhores cães de proteção do mundo.",
		"popularity": 17,
		"min_height": 60.96,
		"max_height": 71.12,
		"min_weight": 27.22,
		"max_weight": 45.36,
		"min_expectancy": 10.00,
		"max_expectancy": 12.00,
		"embbeding": [0.20, 0.80, 1.00, 1.00, 0.60]
	},
	{
		"name": "Dogo argentino",
		"description": "O Dogo Argentino ideal é um estudo em harmonia. Ele é grande, poderoso e atlético. Sua cabeça forte é sustentada por um pescoço grosso, mas elegante, que se conecta a um corpo equilibrado, sustentado por patas dianteiras retas e substanciais e posteriores muito musculosos e de angulações médias. O Dogo dá a impressão de poder e energia explosivos. Desenvolvido para encontrar, perseguir e capturar animais perigosos, o Dogo deve ter um bom nariz, grande capacidade pulmonar e uma constituição muscular poderosa, mas ágil. Sua expressão é alerta e inteligente, com acentuada dureza. O Dogo é instantaneamente identificável por sua pelagem curta e totalmente branca. O Dogo Argentino é um cão de caça de matilha, criado para a caça de grandes animais como javalis e puma, e possui a força, inteligência e capacidade de resposta rápida de um atleta sério. Sua pelagem curta, lisa e lisa é completamente branca, mas uma mancha escura perto dos olhos é permitida desde que não cubra mais de 10% da cabeça.",
		"min_height": 60.96,
		"max_height": 67.31,
		"min_weight": 39.92,
		"max_weight": 45.36,
		"min_expectancy": 9.00,
		"max_expectancy": 15.00,
		"embbeding": [0.20, 0.20, 1.00]
	},
	{
		"name": "Buldogue francês",
		"description": "O Bulldog Francês se assemelha a um Bulldog em miniatura, exceto pelas grandes e eretas “orelhas de morcego” que são a marca registrada da raça. A cabeça é grande e quadrada, com fortes rugas enroladas acima do nariz extremamente curto. O corpo sob a pelagem lisa e brilhante é compacto e musculoso. O brilhante e afetuoso Frenchie é encantador. Cães de poucas palavras, os franceses não latem muito, mas seu estado de alerta os torna excelentes cães de guarda. Eles se adaptam alegremente à vida com solteiros, casais ou famílias e não necessitam de muitos exercícios ao ar livre. Eles se dão bem com outros animais e gostam de fazer novos amigos do tipo humano. Não é de admirar que os moradores da cidade, de Paris a Peoria, confiem nesta raça muito divertida e sociável. O único Bulldog Francês, com suas grandes orelhas de morcego e disposição equilibrada, é uma das raças de cães pequenos mais populares do mundo, especialmente entre os moradores das cidades. O Frenchie é brincalhão, alerta, adaptável e completamente irresistível.",
		"popularity": 4,
		"min_height": 27.94,
		"max_height": 33.02,
		"min_weight": 12.70,
		"max_weight": 12.70,
		"min_expectancy": 10.00,
		"max_expectancy": 12.00,
		"embbeding": [0.20, 0.80, 0.40, 0.60, 0.60]
	},
	{
		"name": "Golden retriever",
		"description": "O Golden Retriever é um cão robusto e musculoso de tamanho médio, famoso pela pelagem dourada densa e brilhante que dá nome à raça. A cabeça larga, com olhos amigáveis ​​e inteligentes, orelhas curtas e focinho reto, é uma marca registrada da raça. Em movimento, os Goldens se movem com um andar suave e poderoso, e a cauda emplumada é portada, como dizem os criadores da raça, com uma “ação alegre”. Os registros mais completos do desenvolvimento do Golden Retriever estão incluídos nos livros de recordes que foram mantido de 1835 até cerca de 1890 pelos guarda-caças da propriedade Guisachan (pronuncia-se Gooeesicun) de Lord Tweedmouth em Inverness-Shire, Escócia. Esses registros foram divulgados ao público na Country Life em 1952, quando o sobrinho-neto de Lord Tweedmouth, o sexto conde de Ilchester, historiador e esportista, publicou material que havia sido deixado por seu ancestral. Eles forneceram confirmação factual às histórias que foram transmitidas através de gerações. Goldens são cães de família extrovertidos, confiáveis ​​​​e ansiosos para agradar, e relativamente fáceis de treinar. Eles adotam uma abordagem alegre e divertida da vida e mantêm esse comportamento de filhote até a idade adulta. Esses gundogs enérgicos e poderosos gostam de brincar ao ar livre. Para uma raça criada para capturar aves aquáticas por horas a fio, nadar e buscar são passatempos naturais. O Golden Retriever, um exuberante cão de caça escocês de grande beleza, está entre as raças de cães mais populares da América. Eles trabalham seriamente na caça e no trabalho de campo, como guias de cegos e em busca e salvamento, gostam de obediência e de outros eventos competitivos e têm um amor cativante pela vida quando não estão no trabalho.",
		"popularity": 3,
		"min_height": 54.61,
		"max_height": 60.96,
		"min_weight": 24.95,
		"max_weight": 34.02,
		"min_expectancy": 10.00,
		"max_expectancy": 12.00,
		"embbeding": [0.40, 0.60, 1.00, 1.00, 0.80]
	},
	{
		"name": "Havanês",
		"description": "As características distintivas do Havanese incluem uma cauda enrolada e uma linda pelagem sedosa, que vem em uma variedade de cores. Alguns proprietários gostam de amarrar o casaco, no estilo de um Puli, e outros o cortam curto para reduzir o tempo de preparação. Felizmente, os Havenese são igualmente fofos, não importa o penteado que você dê a eles. Seus corpos pequenos, mas robustos, natureza adaptável e habilidades sociais fazem do Havanese um cão de cidade ideal, mas eles se contentam em estar em qualquer lugar onde possam chamar a atenção de admiradores jovens. e velhos. Havaneses, extrovertidos inteligentes e treináveis, com os instintos cômicos de um palhaço nato, são cães trapaceiros naturais. Havanese também são excelentes cães de guarda e levam o trabalho a sério, mas geralmente mantêm os latidos no mínimo. Havanese, a única raça de cães nativa de Cuba, são cachorrinhos alegres, com passos saltitantes e brilho nos grandes olhos castanhos. Esses companheiros vivazes e sociáveis ​​estão se tornando especialmente populares entre os moradores das cidades americanas.",
		"popularity": 24,
		"min_height": 21.59,
		"max_height": 29.21,
		"min_weight": 3.18,
		"max_weight": 5.90,
		"min_expectancy": 14.00,
		"max_expectancy": 16.00,
		"embbeding": [0.60, 0.40, 0.60, 0.80, 1.00]
	},
	{
		"name": "Galgo italiano",
		"description": "IGs são Greyhounds em miniatura – mais esbeltos, mas iguais a um Greyhound em graça e elegância. Idealmente com 13 a 15 polegadas de altura no ombro, eles apresentam linhas elegantes e curvas comuns a todos os cães de caça. As características distintivas são as pernas longas e de ossos finos. Os IGs combinam a atenção dos cachorrinhos com a complexidade dos cães de caça antigos e aristocráticos. Criados durante séculos para serem companheiros amorosos e bobos da corte, esses encantadores e arrogantes recusam-se a ser ignorados. “No geral”, escreve um especialista do IG, “a raça prefere estar no seu colo ou na cama do que no chão”. Eles são, no entanto, verdadeiros galgos e disparam atrás de presas que se movem rapidamente ao cair de um gato. Uma raça de pelagem curta e baixo teor de gordura, os IGs requerem cuidado extra em climas frios. Um verdadeiro galgo em miniatura, o elegante galgo italiano é um companheiro de brinquedo alerta, brincalhão e altamente afetuoso. IGs são cães de sofá decorativos, mas no fundo eles são cães de caça rápidos e velozes com instinto de perseguição.",
		"popularity": 73,
		"min_height": 33.02,
		"max_height": 38.10,
		"min_weight": 3.18,
		"max_weight": 6.35,
		"min_expectancy": 14.00,
		"max_expectancy": 15.00,
		"embbeding": [0.20, 0.60, 0.60, 0.40, 0.20]
	},
	{
		"name": "Labrador retriever",
		"description": "O robusto e bem equilibrado Labrador Retriever pode, dependendo do sexo, medir de 21,5 a 24,5 polegadas no ombro e pesar entre 55 a 80 libras. A pelagem densa e dura vem em amarelo, preto e um delicioso chocolate. A cabeça é larga, os olhos brilham com gentileza e a “cauda de lontra” grossa e afilada parece estar sempre sinalizando a ansiedade inata da raça. Eles são companheiros de casa companheiros que se relacionam com toda a família e se socializam bem com os cães vizinhos e também com os humanos. Mas não confunda sua personalidade descontraída com pouca energia: The Lab é um atleta entusiasmado que exige muito exercício, como natação e maratonas de busca, para se manter em boa forma física e mental. O adorável e doce Labrador Retriever é a raça de cães mais popular da América. Os laboratórios são companheiros amigáveis, extrovertidos e espirituosos que têm carinho mais do que suficiente para atender uma família que procura um cachorro de médio a grande porte.",
		"min_height": 54.61,
		"max_height": 62.23,
		"min_weight": 24.95,
		"max_weight": 36.29,
		"min_expectancy": 10.00,
		"max_expectancy": 12.00,
		"embbeding": [1, 0.40, 0.80, 1.00, 1.00, 1.00]
	},
	{
		"name": "Maltês",
		"description": "Os malteses são cachorrinhos afetuosos que pesam menos de três quilos e são cobertos por uma pelagem longa, reta e sedosa. Sob o manto todo branco está um corpo compacto que se move com uma marcha suave e sem esforço. A imagem geral retrata elegância e equilíbrio fluidos. O irresistível rosto maltês - com seus grandes olhos escuros e nariz preto em formato de gota - pode conquistar a sensibilidade mais cansada. Apesar de seu porte aristocrático, os malteses são animais de estimação resistentes e adaptáveis. Eles são cães de guarda alertas e destemidos, como um charmoso cachorro de brinquedo, e são pequenos atletas na pista de agilidade. Os malteses têm pouca queda, têm vida longa e ficam felizes em fazer novos amigos de todas as idades. Às vezes teimosos e obstinados, eles respondem bem ao treinamento baseado em recompensas. O minúsculo maltês, “Ye Ancient Dogge of Malta”, está sentado no colo do luxo desde que a Bíblia era um trabalho em andamento. Famosos por seu casaco que vai até o chão, os malteses são companheiros de brinquedo brincalhões, charmosos e adaptáveis.",
		"popularity": 37,
		"min_height": 17.78,
		"max_height": 22.86,
		"min_weight": 3.18,
		"max_weight": 3.18,
		"min_expectancy": 12.00,
		"max_expectancy": 15.00,
		"embbeding": [0.80, 0.20, 0.60, 0.60, 1.00]
	},
	{
		"name": "Mastim",
		"description": "Para os não iniciados, um encontro cara a cara com estes gigantes mascarados de preto pode ser surpreendente. Um homem tem pelo menos 30 centímetros de altura no ombro e pode pesar mais que um homem adulto. O corpo retangular é profundo e musculoso, coberto por uma curta camada dupla de listras fulvas, damascas ou tigradas. A cabeça é larga e maciça, e a testa enrugada acentua uma expressão alerta e gentil. Mastins são companheiros e guardiões pacientes e adoráveis ​​que se adaptam melhor ao treinamento gentil. Mastins eternamente leais protegem a família, e uma cautela natural com estranhos torna o treinamento e a socialização precoces essenciais. Mastins são animais de estimação magníficos, mas adquirir um cão poderoso de raça gigante é um compromisso que não deve ser menosprezado. O colossal Mastim pertence a um clã canino tão antigo quanto a própria civilização. Um cão enorme e de ossatura pesada, de coragem e força prodigiosa, o Mastim é dócil e digno, mas também um formidável protetor daqueles a quem ama.",
		"popularity": 29,
		"min_height": 69.85,
		"max_height": 76.20,
		"min_weight": 54.43,
		"max_weight": 104.33,
		"min_expectancy": 6.00,
		"max_expectancy": 10.00,
		"embbeding": [0.20, 0.40, 0.60, 0.60, 0.60]
	},
	{
		"name": "Mudi",
		"description": "O Mudi (pronuncia-se “moodie”) é um cão pastor de tamanho médio da Hungria que existe desde o século XIX. Diz-se que o Mudi evoluiu naturalmente a partir de cruzamentos das raças Puli, Pumi e Spitz Alemão. Hoje, o Mudi, embora muito raro, é visto como uma raça de trabalho ativa, inteligente e dócil. Estima-se que não existam mais do que alguns milhares de Mudi em todo o mundo, com os maiores números na Hungria, seguida pela Finlândia, e ainda mais escassos na Europa, nos EUA e no Canadá. O Mudi é excelente em agilidade, obediência e flyball, bem como em outros esportes caninos. Ele é uma verdadeira raça de trabalho e brilha no pastoreio de gado e ovelhas, e encontrou fama como cão de busca e resgate na Finlândia e nos EUA. Detalhes de contato do clubeClube: Mudi Club of AmericaNome: Susanne AndersonE-mail: sande2404@gmail.com The Mudi é um cão de fazenda húngaro extremamente versátil, inteligente, alerta, ágil e versátil. Sua coragem é útil para trabalhar até o gado mais teimoso. A raça é uma protetora leal da propriedade e dos membros da família, sem ser excessivamente agressiva.",
		"min_height": 38.10,
		"max_height": 46.99,
		"min_weight": 8.16,
		"max_weight": 13.15,
		"min_expectancy": 12.00,
		"max_expectancy": 14.00,
		"embbeding": [0.20, 0.40, 1.00, 1.00, 0.40]
	},
	{
		"name": "Corgi galês pembroke",
		"description": "Com 25 a 30 centímetros de altura no ombro e 27 a 30 libras, um Pembroke macho bem construído apresenta um cachorro grande em um pacote pequeno. Pernas curtas, mas poderosas, coxas musculosas e um peito profundo equipam-no para um dia duro de trabalho. Construídos longos e baixos, os Pembrokes são surpreendentemente rápidos e ágeis. Eles podem ser vermelhos, zibelina, fulvo e preto e castanho, com ou sem manchas brancas. O Pembroke é um cão inteligente e sensível que gosta de brincar com sua família humana e responde bem ao treinamento. Como pastores criados para movimentar o gado, eles são destemidos e independentes. São cães de guarda vigilantes, com sentidos aguçados e latidos de “cachorro grande”. As famílias que conseguem satisfazer a necessidade de atividade e união de seu ousado, mas gentil Pembroke, nunca terão um animal de estimação mais leal e amoroso. Entre os mais agradáveis ​​​​de todos os pequenos cães domésticos, o Pembroke Welsh Corgi é um pequeno pastor forte, atlético e animado, afetuoso e sociável sem ser carente. Eles são uma das raças de pastoreio mais populares do mundo.",
		"popularity": 13,
		"min_height": 25.40,
		"max_height": 30.48,
		"min_weight": 12.70,
		"max_weight": 13.61,
		"min_expectancy": 12.00,
		"max_expectancy": 13.00,
		"embbeding": [0.40, 0.80, 0.80, 0.60, 1.00]
	},
	{
		"name": "Pomerânia",
		"description": "O Pomeranian combina um corpo minúsculo (não mais que três quilos) e um comportamento imponente de cachorro grande. A abundante pelagem dupla, com babados que se estende pelo peito e ombros, vem em quase duas dúzias de cores, e vários padrões e marcações, mas é mais comumente vista em laranja ou vermelho. Alertas e inteligentes, os Pomeranianos são facilmente treinados e são excelentes cães de guarda. e animais de estimação alegres para famílias com crianças com idade suficiente para saber a diferença entre um cachorro de brinquedo e um brinquedo. Os Poms são ativos, mas podem ser exercitados com brincadeiras internas e caminhadas curtas, por isso ficam satisfeitos tanto na cidade quanto nos subúrbios. Eles dominarão truques e jogos com facilidade, embora sua atividade favorita seja proporcionar risadas e companhia ao seu ser humano especial. O pequeno Pomeranian, há muito tempo favorito tanto da realeza quanto dos plebeus, tem sido considerado o companheiro ideal. A pelagem gloriosa, o sorriso, o rosto de raposa e a personalidade vivaz ajudaram a tornar o Pom uma das raças de brinquedo mais populares do mundo.",
		"popularity": 23,
		"min_height": 15.24,
		"max_height": 17.78,
		"min_weight": 1.36,
		"max_weight": 3.18,
		"min_expectancy": 12.00,
		"max_expectancy": 16.00,
		"embbeding": [0.60, 0.60, 0.60, 0.60, 0.60]
	},
	{
		"name": "Caniche (miniatura)",
		"description": "Os poodles vêm em três variedades de tamanho: os padrões devem ter mais de 15 centímetros de altura nos ombros; As miniaturas têm 15 polegadas ou menos; Os brinquedos não têm mais de 25 centímetros. Todas as três variedades têm a mesma constituição e proporções. Em exposições caninas, os Poodles geralmente são vistos no elaborado Continental Clip. A maioria dos donos de animais de estimação prefere o Sporting Clip mais simples, no qual a pelagem é tosquiada para seguir o contorno do corpo quadrado e musculoso. Esqueça aqueles velhos estereótipos de Poodles como cachorros maricas. Os poodles são “cães reais” ávidos, atléticos e extremamente inteligentes, com notável versatilidade. O Standard, com seu maior tamanho e força, é o melhor atleta versátil da família, mas todos os Poodles podem ser treinados com grande sucesso. Seja padrão, miniatura ou brinquedo, e preto, branco ou damasco, o Poodle está orgulhosamente entre os verdadeiros aristocratas do dogdom. Por baixo da pelagem encaracolada e com baixo teor de alérgenos está um atleta elegante e companheiro para todos os motivos e estações.",
		"popularity": 7,
		"min_height": 25.40,
		"max_height": 38.10,
		"min_weight": 4.54,
		"max_weight": 6.80,
		"min_expectancy": 10.00,
		"max_expectancy": 18.00,
		"embbeding": []
	},
	{
		"name": "Caniche (padrão)",
		"description": "Os poodles vêm em três variedades de tamanho: os padrões devem ter mais de 15 centímetros de altura nos ombros; As miniaturas têm 15 polegadas ou menos; Os brinquedos não têm mais de 25 centímetros. Todas as três variedades têm a mesma constituição e proporções. Em exposições caninas, os Poodles geralmente são vistos no elaborado Continental Clip. A maioria dos donos de animais de estimação prefere o Sporting Clip mais simples, no qual a pelagem é tosquiada para seguir o contorno do corpo quadrado e musculoso. Esqueça aqueles velhos estereótipos de Poodles como cachorros maricas. Os poodles são “cães reais” ávidos, atléticos e extremamente inteligentes, com notável versatilidade. O Standard, com seu maior tamanho e força, é o melhor atleta versátil da família, mas todos os Poodles podem ser treinados com grande sucesso. Seja padrão, miniatura ou brinquedo, e preto, branco ou damasco, o Poodle está orgulhosamente entre os verdadeiros aristocratas do dogdom. Por baixo da pelagem encaracolada e com baixo teor de alérgenos está um atleta elegante e companheiro para todos os motivos e estações.",
		"popularity": 7,
		"min_height": 38.10,
		"max_height": 38.10,
		"min_weight": 18.14,
		"max_weight": 31.75,
		"min_expectancy": 10.00,
		"max_expectancy": 18.00,
		"embbeding": [1.00, 0.20, 0.60, 1.00, 0.80]
	},
	{
		"name": "Caniche",
		"description": "Os poodles vêm em três variedades de tamanho: os padrões devem ter mais de 15 centímetros de altura nos ombros; As miniaturas têm 15 polegadas ou menos; Os brinquedos não têm mais de 25 centímetros. Todas as três variedades têm a mesma constituição e proporções. Em exposições caninas, os Poodles geralmente são vistos no elaborado Continental Clip. A maioria dos donos de animais de estimação prefere o Sporting Clip mais simples, no qual a pelagem é tosquiada para seguir o contorno do corpo quadrado e musculoso. Esqueça aqueles velhos estereótipos de Poodles como cachorros maricas. Os poodles são “cães reais” ávidos, atléticos e extremamente inteligentes, com notável versatilidade. Com muito caráter estável e inteligência, o Toy Poodle é uma “pessoa” e espera ser tratado como tal. Apesar de seu tamanho diminuto, o Toy Poodle está orgulhosamente entre os verdadeiros aristocratas do dogdom. Por baixo da pelagem encaracolada e com baixo teor de alérgenos está um atleta elegante e companheiro para todos os motivos e estações.",
		"popularity": 7,
		"min_height": 25.40,
		"max_height": 25.40,
		"min_weight": 1.81,
		"max_weight": 2.72,
		"min_expectancy": 10.00,
		"max_expectancy": 18.00,
		"embbeding": [1.00, 0.20, 0.60, 1.00, 0.80]
	},
	{
		"name": "Pug",
		"description": "O lema do Pug é a frase em latim “multum in parvo” (muito em pouco) – uma descrição adequada desta raça pequena, mas musculosa. Eles vêm em três cores: prata ou fulvo damasco com máscara preta, ou totalmente preto. A grande cabeça redonda, os olhos grandes e brilhantes e a testa enrugada dão aos Pugs uma série de expressões humanas - surpresa, felicidade, curiosidade - que encantam os proprietários há séculos. Os proprietários de Pugs dizem que sua raça é o cão doméstico ideal. Pugs ficam felizes na cidade ou no campo, com crianças ou idosos, como único animal de estimação ou em matilha. Eles gostam da comida e devem ser tomados cuidados para mantê-los em boa forma. Eles se dão melhor em climas moderados - nem muito quentes, nem muito frios - mas, com os devidos cuidados, os Pugs podem ser adoráveis ​​em qualquer lugar. Outrora companheiro travesso dos imperadores chineses e mais tarde mascote da Casa Real de Orange da Holanda, o pequeno mas sólido Pug é hoje adorado por seus milhões de fãs em todo o mundo. Pugs vivem para amar e ser amados em troca.",
		"popularity": 28,
		"min_height": 25.40,
		"max_height": 33.02,
		"min_weight": 6.35,
		"max_weight": 8.16,
		"min_expectancy": 13.00,
		"max_expectancy": 15.00,
		"embbeding": [0.40, 0.80, 0.60, 0.60, 0.80]
	},
	{
		"name": "Rottweiler",
		"description": "Um Rottweiler macho terá entre 24 e 27 polegadas musculares no ombro; as fêmeas são um pouco menores e mais leves. O casaco preto curto e brilhante com marcas de ferrugem elegantes adicionam à imagem de força imponente. Um traseiro musculoso fortalece o trote sem esforço do Rottie. Um Rottie bem criado e bem criado será calmo e confiante, corajoso, mas não excessivamente agressivo. O comportamento indiferente que esses guardiões de classe mundial apresentam aos estranhos desmente a brincadeira e a tolice absoluta que tornam os Rotties queridos por seus entes queridos. (Ninguém disse ao Rottie que ele não é uma raça de brinquedo, então ele pode se jogar no seu colo para um abraço.) O treinamento e a socialização precoces irão aproveitar os instintos territoriais de um Rottie de uma forma positiva. O Rottweiler é uma raça de trabalho robusta e de grande força, descendente dos mastins das legiões romanas. Gentil companheiro de brincadeiras e protetor dentro do círculo familiar, o Rottie observa o mundo exterior com uma indiferença autoconfiante.",
		"popularity": 8,
		"min_height": 55.88,
		"max_height": 68.58,
		"min_weight": 36.29,
		"max_weight": 61.23,
		"min_expectancy": 9.00,
		"max_expectancy": 10.00,
		"embbeding": [0.40, 0.60, 0.60, 0.60, 0.40]
	},
	{
		"name": "São bernardo",
		"description": "Não tendo uma classificação particularmente elevada nos registros do AKC, este gigante genial está, no entanto, entre as raças mais famosas e amadas do mundo. O padrão escrito do Santo está repleto de frases como “muito poderoso”, “extraordinariamente musculoso”, “imponente” e “maciço”. Um homem mede no mínimo 27,5 polegadas no ombro; as fêmeas serão menores e de constituição mais delicada. A enorme cabeça apresenta uma testa enrugada, um focinho curto e olhos escuros, combinando-se para dar aos Santos a expressão inteligente e amigável que era uma visão tão bem-vinda para os viajantes alpinos perdidos. O São Bernardo não tem uma classificação muito elevada nos registros do AKC, mas o genial gigante dos Alpes Suíços está, mesmo assim, entre as raças mais famosas e amadas do mundo. Os santos são famosos por serem vigilantes, pacientes e cuidadosos com as crianças.",
		"popularity": 48,
		"min_height": 66.04,
		"max_height": 76.20,
		"min_weight": 54.43,
		"max_weight": 81.65,
		"min_expectancy": 8.00,
		"max_expectancy": 10.00,
		"embbeding": [0.40, 0.60, 0.60, 0.60, 0.80]
	},
	{
		"name": "Cão Pastor de Shetland",
		"description": "O Shetland Sheepdog é um cão pastor pequeno, ativo e ágil, medindo entre 13 e 16 polegadas no ombro. A pelagem longa é áspera e reta, com subpêlo denso, e vem nas cores preto, azul merle e zibelina, com manchas brancas. A pelagem, junto com uma cabeça longa em forma de cunha; orelhas pequenas, três quartos eretas; e torso profundo e nivelado, dão aos Shelties a aparência de um Collie de pelagem áspera em miniatura. Shelties brilhantes e ansiosos são treinadores fáceis e competidores de classe mundial em obediência, agilidade e testes de pastoreio. São cães de família sensíveis e afetuosos, muito sintonizados com o clima da casa. Eles gostam de latir e tendem a ser reservados com estranhos – duas qualificações de um excelente cão de guarda. O Shetland Sheepdog, também conhecido como Sheltie, é um pastor extremamente inteligente, rápido e obediente das remotas e acidentadas Ilhas Shetland da Escócia. Shelties têm uma forte semelhança familiar com seu primo mais velho, o Collie.",
		"popularity": 25,
		"min_height": 33.02,
		"max_height": 40.64,
		"min_weight": 6.80,
		"max_weight": 11.34,
		"min_expectancy": 12.00,
		"max_expectancy": 14.00,
		"embbeding": [0.60, 0.60, 0.60, 1.00, 0.40]
	},
	{
		"name": "Shiba Inu",
		"description": "Trazidos do Japão para a América há apenas 60 anos, os Shibas estão crescendo em popularidade no Ocidente e já são a raça mais popular em sua terra natal. Suas manchas brancas combinadas com sua coloração (vermelho, gergelim vermelho ou preto e castanho) e sua expressão alerta e passos suaves os tornam quase parecidos com uma raposa. Eles são cães robustos e musculosos, com uma personalidade ousada e confiante. Uma antiga raça japonesa, o Shiba Inu é um cão pequeno, mas musculoso, que já foi empregado como caçador. Hoje, o espirituoso e bem-humorado Shiba é o cão de companhia mais popular no Japão. O adaptável Shiba se sente em casa na cidade ou no campo.",
		"popularity": 44,
		"min_height": 34.29,
		"max_height": 41.91,
		"min_weight": 7.71,
		"max_weight": 10.43,
		"min_expectancy": 13.00,
		"max_expectancy": 16.00,
		"embbeding": [0.40, 0.60, 0.60, 0.40, 0.40]
	},
	{
		"name": "Shih tzu",
		"description": "Shih Tzu (pronunciado no Ocidente como “sheed-zoo” ou “sheet-su”; os chineses dizem “sher-zer”), pesando entre 9 e 16 libras e medindo entre 20 e 28 centímetros, é surpreendentemente sólido para cães. tamanho. O casaco, que vem em várias cores, vale o tempo que você dedica a ele - poucos cães são tão bonitos quanto um Shih Tzu bem cuidado. Ser fofo é um modo de vida para esse encantador e animado. O Shih Tzu é conhecido por ser especialmente afetuoso com crianças. Por ser um cão pequeno criado para passar a maior parte do dia dentro de palácios reais, ele é um ótimo animal de estimação se você mora em um apartamento ou não tem um grande quintal. Alguns cães vivem para cavar buracos e perseguir gatos, mas a ideia de diversão de um Shih Tzu é sentar em seu colo e agir de maneira adorável enquanto tenta assistir TV. Essa cara! Aqueles grandes olhos escuros olhando para você com aquela expressão doce! Não é nenhuma surpresa que os proprietários de Shih Tzu estejam tão encantados com este pequeno “Cão Leão” há mil anos. Aonde quer que Shih Tzu vá, seguem-se risadas e travessuras.",
		"popularity": 20,
		"min_height": 22.86,
		"max_height": 26.67,
		"min_weight": 4.08,
		"max_weight": 7.26,
		"min_expectancy": 10.00,
		"max_expectancy": 18.00,
		"embbeding": [0.80, 0.20, 0.60, 0.60, 0.80]
	},
	{
		"name": "Whippet",
		"description": "Com algo entre 18 e 22 polegadas no ombro, o Whippet parece um Greyhound, mas menor. O Whippet exibe as clássicas linhas “S invertido” do sighthound. O peito profundo e a cintura fina; uma cabeça magra sustentada por um pescoço longo e arqueado; e pernas finas, mas robustas, combinam-se na imagem de um atleta ágil e ágil. Entre explosões de intensa perseguição, os Whippets adoram se esticar e relaxar por longas horas, desempenhando o papel de um companheiro amoroso e amado. Whippets gostam de correr em um quintal cercado, mas também se dão bem em apartamentos aconchegantes - desde que sejam exercitados adequadamente. Outra vantagem para os moradores da cidade: os Whippets raramente latem. Apesar da aparência elegante da raça, o Whippet é um cão robusto e de baixa manutenção. O elegante e de rosto doce Whippet, o “Cavalo de Corrida do Pobre Homem”, é extremamente rápido. Ele é uma alma amável, digna e gentil, mas dê-lhe algo para perseguir e ele estará pronto. O nome Whippet é sinônimo de graça simplificada.",
		"popularity": 61,
		"min_height": 45.72,
		"max_height": 55.88,
		"min_weight": 11.34,
		"max_weight": 18.14,
		"min_expectancy": 12.00,
		"max_expectancy": 15.00,
		"embbeding": [0.20, 0.40, 0.60, 0.40, 0.40]
	},
	{
		"name": "Yorkshire Terrier",
		"description": "O Yorkshire Terrier é um terrier compacto, do tamanho de um brinquedo, com não mais de três quilos, cuja maior glória é uma pelagem sedosa azul aço que vai até o chão e um rico bronzeado dourado. Tenaz, agressivo, corajoso e às vezes mandão, o Yorkie exibe todas as características de um verdadeiro terrier. Muitas vezes considerada a raça de cães mais popular em várias cidades americanas, os Yorkies reúnem muita atitude de cidade grande em um pacote pequeno, mas presunçoso. Eles são os favoritos dos moradores urbanos de todo o mundo. Os Yorkies têm vida longa e são pouco alergênicos (a pelagem se parece mais com cabelo humano do que com pele de animal) e são ótimos pequenos cães de guarda. Esta é uma verdadeira “raça de personalidade”, proporcionando anos de risadas, amor e companheirismo próximo. Por baixo da pelagem delicada e brilhante de um Yorkshire Terrier, bate o coração de um terrier agressivo e antigo. Os Yorkies ganhavam a vida como caçadores de minas e moinhos muito antes de se tornarem cachorrinhos enfeitados com fitas das mulheres vitorianas.",
		"popularity": 10,
		"min_height": 17.78,
		"max_height": 20.32,
		"min_weight": 3.18,
		"max_weight": 3.18,
		"min_expectancy": 11.00,
		"max_expectancy": 15.00,
		"embbeding": [1.00, 0.20, 0.60, 0.20, 0.80]
	}
]
