[
	{
		"name": "Akita",
		"description": "Akitas are burly, heavy-boned spitz-type dogs of imposing stature. Standing 24 to 28 inches at the shoulder, Akitas have a dense coat that comes in several colors, including white. The head is broad and massive, and is balanced in the rear by a full, curled-over tail. The erect ears and dark, shining eyes contribute to an expression of alertness, a hallmark of the breed.Akitas are quiet, fastidious dogs. Wary of strangers and often intolerant of other animals, Akitas will gladly share their silly, affectionate side with family and friends. They thrive on human companionship. The large, independent-thinking Akita is hardwired for protecting those they love. They must be well socialized from birth with people and other dogs. Akitas are muscular, double-coated dogs of ancient Japanese lineage famous for their dignity, courage, and loyalty. In their native land, they are venerated as family protectors and symbols of good health, happiness, and long life.",
		"popularity": 47,
		"min_height": 60.96,
		"max_height": 71.12,
		"min_weight": 31.75,
		"max_weight": 58.97,
		"min_expectancy": 10.00,
		"max_expectancy": 13.00,
		"embbeding": [0.80, 0.60, 0.80, 1.00, 0.60]
	},
	{
		"name": "Australian Cattle Dog",
		"description": "Standing between 17 to 20 inches at the shoulder, the Australian Cattle Dog is a sturdy, hard-muscled herder of strength and agility. The ACD is born with a white coat that turns blue-gray or red. Both coat varieties feature distinctive mottling or specking patterns. ACDs have immense work drive and excel at hunting, chasing, and, of course, moving livestock. Their boundless energy and supple gait make them excellent running partners.ACDs are true-blue loyal, famously smart, ever alert, and wary of strangers. If an ACD isn’t challenged, he easily becomes bored and gets into mischief. It is recommended that ACD owners participate with their dog in some work, sport, or regular exercise to keep him mentally and physically fit. The compact but muscular Australian Cattle Dog, also called Blue Heeler or Queensland Heeler, is related to Australia’s famous wild dog, the Dingo. These resilient herders are intelligent enough to routinely outsmart their owners.",
		"popularity": 55,
		"min_height": 43.18,
		"max_height": 50.80,
		"min_weight": 15.88,
		"max_weight": 22.68,
		"min_expectancy": 12.00,
		"max_expectancy": 16.00,
		"embbeding": [0.20, 0.80, 1.00, 0.20, 0.40]
	},
	{
		"name": "Australian Shepherd",
		"description": "The Australian Shepherd, the cowboy’s herding dog of choice, is a medium-sized worker with a keen, penetrating gaze in the eye. Aussie coats offer different looks, including merle (a mottled pattern with contrasting shades of blue or red). In all ways, they’re the picture of rugged and agile movers of stock. Aussies exhibit an irresistible impulse to herd, anything: birds, dogs, kids. This strong work drive can make Aussies too much dog for a sedentary pet owner. Aussies are remarkably intelligent, quite capable of hoodwinking an unsuspecting novice owner. In short, this isn’t the pet for everyone. But if you’re looking for a brainy, tireless, and trainable partner for work or sport, your search might end here. The Australian Shepherd, a lean, tough ranch dog, is one of those “only in America” stories: a European breed perfected in California by way of Australia. Fixtures on the rodeo circuit, they are closely associated with the cowboy life.",
		"popularity": 17,
		"min_height": 45.72,
		"max_height": 58.42,
		"min_weight": 18.14,
		"max_weight": 29.48,
		"min_expectancy": 12.00,
		"max_expectancy": 15.00,
		"embbeding": [0.40, 0.60, 0.80, 1.00, 0.60]
	},
	{
		"name": "Basset Hound",
		"description": "The Basset Hound stands no higher than 14 inches at the shoulder but, with his remarkably heavy bone, powerful little legs, and massive paws, he possesses big-dog strength and stamina. Bassets are famous for a large, domed head that features extremely long, velvety ears, mournful eyes, and a wrinkled brow, which give the breed the look of a sad clown. Built more for endurance than speed, the Basset moves in a deliberate but effortless manner. The breed’s scenting ability is uncanny; it’s said that among dogs only the Bloodhound’s nose is more accurate. Mild and agreeable at home, the Basset is stubborn on the trail and barks in a loud, ringing voice. Although they may not be wildly demonstrative in their affections, they are steadfastly loyal. Among the most appealing of the AKC breeds, the endearing and instantly recognizable Basset Hound is a perennial favorite of dog lovers all over the world. This low-slung and low-key hound can be sometimes stubborn, but is always charming.",
		"popularity": 39,
		"min_height": 38.10,
		"max_height": 38.10,
		"min_weight": 18.14,
		"max_weight": 29.48,
		"min_expectancy": 12.00,
		"max_expectancy": 13.00,
		"embbeding": [0.60, 0.40, 0.20, 0.40, 0.80]
	},
	{
		"name": "Beagle",
		"description": "There are two Beagle varieties: those standing under 13 inches at the shoulder, and those between 13 and 15 inches. Both varieties are sturdy, solid, and “big for their inches,” as dog folks say. They come in such pleasing colors as lemon, red and white, and tricolor. The Beagle’s fortune is in his adorable face, with its big brown or hazel eyes set off by long, houndy ears set low on a broad head.A breed described as “merry” by its fanciers, Beagles are loving and lovable, happy, and companionable—all qualities that make them excellent family dogs. No wonder that for years the Beagle has been the most popular hound dog among American pet owners. These are curious, clever, and energetic hounds who require plenty of playtime. Not only is the Beagle an excellent hunting dog and loyal companion, it is also happy-go-lucky, funny, and—thanks to its pleading expression—cute. They were bred to hunt in packs, so they enjoy company and are generally easygoing.",
		"popularity": 6,
		"min_height": 33.02,
		"max_height": 38.10,
		"min_weight": 5.90,
		"max_weight": 13.61,
		"min_expectancy": 10.00,
		"max_expectancy": 15.00,
		"embbeding": [0.60, 0.60, 0.80, 0.60, 0.80]
	},
	{
		"name": "Bearded Collie",
		"description": "Standing 20 to 22 inches at the shoulder and covered head to tail in a shaggy double coat, Beardies bear a passing resemblance to another British favorite, the Old English Sheepdog. Beneath the coats, Beardies are the more lean and angular of the two. The lavish facial hair shouldn’t obscure the characteristic expression: a dreamy, faraway gaze.These rambunctious comics can be a handful—but mostly, Beardies are approximately 50 pounds of heart, energy, and laughter. Well-socialized Beardies will get on nicely with other animals and kids. They bore easily, and training must be kept interesting. Outdoorsy families looking for a sturdy dog to share an uptempo lifestyle will never find a more affectionate and amusing sidekick. A boisterous and charismatic droving dog from Scotland, the shaggy-coated Bearded Collie (“Beardie” to his friends) enjoys outdoor exercise in all weather. Bred to be independent decision-makers, they can be willful but are always friendly.",
		"popularity": 127,
		"min_height": 50.80,
		"max_height": 55.88,
		"min_weight": 20.41,
		"max_weight": 24.95,
		"min_expectancy": 12.00,
		"max_expectancy": 14.00,
		"embbeding": [0.80, 0.60, 0.60, 0.40, 1.00]
	},
	{
		"name": "Bichon Frise",
		"description": "A good-size Bichon will stand a shade under a foot tall at the shoulder. The breed’s glory is a white hypoallergenic coat, plush and velvety to the touch, featuring rounded head hair that sets off the large, dark eyes and black leathers of the nose and lips.Bichons are adaptable companions who get on well with other dogs and children. Alert and curious, Bichons make nice little watchdogs—but they are lovers, not fighters, and operate under the assumption that there are no strangers, just friends they haven’t met yet. Their confidence and size make them ideal city dogs. Bichons train nicely and enjoy performing for their loved ones. Finally, there’s the happy-go-lucky Bichon personality that draws smiles and hugs wherever they go. The small but sturdy and resilient Bichon Frise stands among the world’s great “personality dogs.” Since antiquity, these irresistible canine comedians have relied on charm, beauty, and intelligence to weather history’s ups and downs.",
		"popularity": 46,
		"min_height": 24.13,
		"max_height": 29.21,
		"min_weight": 5.44,
		"max_weight": 8.16,
		"min_expectancy": 14.00,
		"max_expectancy": 15.00,
		"embbeding": [1.00, 0.20, 0.60, 0.60, 1.00]
	},
	{
		"name": "Border Collie",
		"description": "Borders are athletic, medium-sized herders standing 18 to 22 inches at the shoulder. The overall look is that of a muscular but nimble worker unspoiled by passing fads. Both the rough coat and the smooth coat come in a variety of colors and patterns.The almond eyes are the focus of an intelligent expression—an intense gaze, the Border’s famous “herding eye”, is a breed hallmark. On the move, Borders are among the canine kingdom’s most agile, balanced, and durable citizens.The intelligence, athleticism, and trainability of Borders have a perfect outlet in agility training. Having a job to perform, like agility—or herding or obedience work—is key to Border happiness. Amiable among friends, they may be reserved with strangers. A remarkably bright workaholic, the Border Collie is an amazing dog—maybe a bit too amazing for owners without the time, energy, or means to keep it occupied. These energetic dogs will settle down for cuddle time when the workday is done.",
		"popularity": 35,
		"min_height": 45.72,
		"max_height": 55.88,
		"min_weight": 13.61,
		"max_weight": 24.95,
		"min_expectancy": 12.00,
		"max_expectancy": 15.00,
		"embbeding": [0.60, 0.60, 1.00, 1.00, 0.40]
	},
	{
		"name": "Borzoi",
		"description": "Borzoi are large, elegant sighthounds. A mature male stands at least 28 inches at the shoulder and weighs 75 to 105 pounds. Females will be smaller. Beneath the luxurious silky coat, Borzoi construction follows the ancient Greyhound template. Once known as the Russian Wolfhound, Borzoi were bred to be swift and tough enough to pursue and pin their ferocious lupine quarry.In their quiet, catlike way they can be stubborn, and training is best accomplished with patience, consistency, and good humor. Affectionate family dogs, Borzoi are nonetheless a bit too dignified to wholeheartedly enjoy a lot of roughhousing. The sight of a cat or squirrel on the run will quickly stir their pursuit instinct, and fenced-in running room is a must. Among the most impressively beautiful of all dogs, the aristocratic Borzoi is cherished for his calm, agreeable temperament. In full stride, he is a princely package of strength, grace, and glamour flying by at 35 to 40 miles per hour.",
		"popularity": 103,
		"min_height": 66.04,
		"max_height": 71.12,
		"min_weight": 27.22,
		"max_weight": 47.63,
		"min_expectancy": 9.00,
		"max_expectancy": 14.00,
		"embbeding": [0.40, 0.60, 0.80, 0.40, 0.60]
	},
	{
		"name": "Boxer",
		"description": "A well-made Boxer in peak condition is an awesome sight. A male can stand as high as 25 inches at the shoulder; females run smaller. Their muscles ripple beneath a short, tight-fitting coat. The dark brown eyes and wrinkled forehead give the face an alert, curious look. The coat can be fawn or brindle, with white markings. Boxers move like the athletes they are named for: smooth and graceful, with a powerful forward thrust.Boxers are upbeat and playful. Their patience and protective nature have earned them a reputation as a great dog with children. They take the jobs of watchdog and family guardian seriously and will meet threats fearlessly. Boxers do best when exposed to a lot of people and other animals in early puppyhood. Loyalty, affection, intelligence, work ethic, and good looks: Boxers are the whole doggy package. Bright and alert, sometimes silly, but always courageous, the Boxer has been among America’s most popular dog breeds for a very long time.",
		"popularity": 11,
		"min_height": 54.61,
		"max_height": 63.50,
		"min_weight": 6.80,
		"max_weight": 36.29,
		"min_expectancy": 10.00,
		"max_expectancy": 12.00,
		"embbeding": [0.40, 0.40, 0.80, 0.80, 1.00]
	},
	{
		"name": "Bull Terrier",
		"description": "Bull Terriers are robust, big-boned terriers who move with a jaunty stride suggesting agility and power. The breed’s hallmark is a long, egg-shaped head with erect and pointed ears, and small, triangular eyes that glisten with good humor. Coats come in two types: white; and any other color (including an attractive brindle striping), either solid or with white markings. A well-made BT is the picture of muscular determination and balance. There are four keys to BT happiness: early socialization with dogs and people; firm but loving training; ample exercise; and lots of quality time with his adored humans. If these requirements are met, there is no more loyal, lovable, and entertaining companion. This is the ultimate “personality breed.” Among the most comical and mischievous citizens of dogdom, the Bull Terrier is playful and endearing, sometimes stubborn, but always devoted. These unique “eggheads” are exuberant, muscular companions who thrive on affection and exercise.",
		"popularity": 62,
		"min_height": 53.34,
		"max_height": 55.88,
		"min_weight": 22.68,
		"max_weight": 31.75,
		"min_expectancy": 12.00,
		"max_expectancy": 13.00,
		"embbeding": [0.40, 0.60, 0.80, 0.40, 0.80]
	},
	{
		"name": "Bulldog",
		"description": "You can’t mistake a Bulldog for any other breed. The loose skin of the head, furrowed brow, pushed-in nose, small ears, undershot jaw with hanging chops on either side, and the distinctive rolling gait all practically scream “I’m a Bulldog!” The coat, seen in a variety of colors and patterns, is short, smooth, and glossy. Bulldogs can weigh up to 50 pounds, but that won’t stop them from curling up in your lap, or at least trying to. But don’t mistake their easygoing ways for laziness—Bulldogs enjoy brisk walks and need regular moderate exercise, along with a careful diet, to stay trim. Summer afternoons are best spent in an air-conditioned room as a Bulldog’s short snout can cause labored breathing in hot and humid weather. Kind but courageous, friendly but dignified, the Bulldog is a thick-set, low-slung, well-muscled bruiser whose “sourmug” face is the universal symbol of courage and tenacity. These docile, loyal companions adapt well to town or country.",
		"popularity": 5,
		"min_height": 35.56,
		"max_height": 38.10,
		"min_weight": 18.14,
		"max_weight": 22.68,
		"min_expectancy": 8.00,
		"max_expectancy": 10.00,
		"embbeding": [0.60, 0.80, 0.60, 0.60, 0.80]
	},
	{
		"name": "Bullmastiff",
		"description": "The Bullmastiff isn’t quite as large as his close cousin the Mastiff. Still, standing as high as 27 inches at the shoulder and weighing between 100 and 130 pounds, this is still a whole lot of dog. After the first impression made by the Bullmastiff’s size, it is the large, broad head that conveys the breed’s essence: the dark eyes, high-set V-shaped ears, and broad, deep muzzle all combine to present the intelligence, alertness, and confidence that make the Bullmastiff a world-class protector and family companion. Coats come in fawn, red, or brindle.These are biddable and reliable creatures, but as with any large guarding dog, owners must begin training and socialization early, while the puppy is still small enough to control. Fearless at work, docile at home, the Bullmastiff is a large, muscular guarder who pursued and held poachers in Merry Old England—merry, we suppose, for everyone but poachers. Bullmastiffs are the result of Bulldog and Mastiff crosses.",
		"popularity": 51,
		"min_height": 60.96,
		"max_height": 68.58,
		"min_weight": 45.36,
		"max_weight": 58.97,
		"min_expectancy": 7.00,
		"max_expectancy": 9.00,
		"embbeding": [0.20, 0.60, 0.80, 0.60, 0.60]
	},
	{
		"name": "Cairn Terrier",
		"description": "The Cairn’s unique qualities, called “Cairnishness,” include a short, wide head and a free-moving, short-legged body that exudes strength but not heaviness, topping out at about 10 inches high and about 15 inches long. The double coat is harsh and wiry on top and downy beneath. A Cairn presents as a small, shaggy, alert dog, with head, tail, and ears up, and eyes shining with intelligence.A British breed club promotes Cairns as the “best little pal in the world.” Cairns are small enough for a lap-top snuggle and sturdy enough for a good romp on the lawn. They do best with lots of close family contact. For owners who cherish the terrier qualities of gameness, independent thinking, and true-blue loyalty, no other breed will do. Cairn Terriers are happy, busy little earthdogs originally bred to fearlessly root out foxes and other small, furred prey in the rocky Scottish countryside. Curious and alert, Cairns like having a place where they can explore and dig.",
		"popularity": 69,
		"min_height": 24.13,
		"max_height": 25.40,
		"min_weight": 5.90,
		"max_weight": 6.35,
		"min_expectancy": 13.00,
		"max_expectancy": 15.00,
		"embbeding": [0.40, 0.40, 0.60, 0.60, 0.80]
	},
	{
		"name": "Cane Corso",
		"description": "At nearly 28 inches at the shoulder and often weighing more than 100 pounds, with a large head, alert expression, and muscles rippling beneath their short, stiff coat, Corsi are at a glance intimidating creatures. Their imposing appearance is their first line of defense against intruders. As one writer put it, “An understated air of cool competence, the kind of demeanor you’d expect from a professional bodyguard, is the breed’s trademark.”Corsi are intelligent, loyal, eager to please, versatile, and intensely loyal to their humans, but are also assertive and willful, and can end up owning an unwitting owner. As with any other big guardian dog, responsible breeding and early socialization with people and other dogs is vital. Smart, trainable, and of noble bearing, the assertive and confident Cane Corso is a peerless protector. The Corso’s lineage goes back to ancient Roman times, and the breed’s name roughly translates from the Latin as “bodyguard dog.”",
		"popularity": 32,
		"min_height": 59.69,
		"max_height": 69.85,
		"min_expectancy": 9.00,
		"max_expectancy": 12.00,
		"embbeding": [0.00, 0.00, 0.20, 0.40, 0.80, 0.60, 0.60]
	},
	{
		"name": "Cavalier King Charles Spaniel",
		"description": "The Cavalier’s all-around beauty, regal grace, and even temper mark him as one of dogdom’s noblemen. A toy spaniel no more than 13 inches high, the Cavalier draws you in with his face: The sweet, gentle, melting expression emanating from large, round eyes is a breed hallmark. Another is the silky, richly-colored coat that can be one of four distinct varieties.Cavaliers may be aristocrats, but they gladly descend from their royal high horse for a backyard frolic or a squirrel chase. They get along nicely with children and other dogs. Adaptable Cavaliers do equally well with active owners and homebodies—they can be upbeat athletes or shameless couch potatoes, depending on an owner’s lifestyle. The Cavalier King Charles Spaniel wears his connection to British history in his breed’s name. Cavaliers are the best of two worlds, combining the gentle attentiveness of a toy breed with the verve and athleticism of a sporting spaniel.",
		"popularity": 18,
		"min_height": 30.48,
		"max_height": 33.02,
		"min_weight": 5.90,
		"max_weight": 8.16,
		"min_expectancy": 12.00,
		"max_expectancy": 15.00,
		"embbeding": [0.40, 0.40, 0.40, 1.00, 0.80]
	},
	{
		"name": "Chihuahua",
		"description": "The Chihuahua is a balanced, graceful dog of terrier-like demeanor, weighing no more than 6 pounds. The rounded “apple” head is a breed hallmark. The erect ears and full, luminous eyes are acutely expressive. Coats come in many colors and patterns, and can be long or short. The varieties are identical except for coat.Chihuahuas possess loyalty, charm, and big-dog attitude. Even tiny dogs require training, and without it this clever scamp will rule your household like a little Napoleon. Compact and confident, Chihuahuas are ideal city pets. They are too small for roughhousing with kids, and special care must be taken in cold weather, but Chihuahuas are adaptable—as long as they get lots of quality time in their preferred lap. The Chihuahua is a tiny dog with a huge personality. A national symbol of Mexico, these alert and amusing 'purse dogs' stand among the oldest breeds of the Americas, with a lineage going back to the ancient kingdoms of pre-Columbian times.",
		"popularity": 33,
		"min_height": 12.70,
		"max_height": 20.32,
		"min_weight": 2.72,
		"max_weight": 2.72,
		"min_expectancy": 14.00,
		"max_expectancy": 16.00,
		"embbeding": [0.20, 0.40, 0.60, 0.40, 0.60]
	},
	{
		"name": "Chow Chow",
		"description": "Chows are powerful, compactly built dogs standing as high as 20 inches at the shoulder. Their distinctive traits include a lion’s-mane ruff around the head and shoulders; a blue-black tongue; deep-set almond eyes that add to a scowling, snobbish expression; and a stiff-legged gait. Chows can have rough or smooth coats of red, black, blue, cinnamon, or cream.Owners say Chows are the cleanest of dogs: They housebreak easily, have little doggy odor, and are known to be as fastidious as cats. Well-socialized Chows are never fierce or intractable, but always refined and dignified. They are aloof with strangers and eternally loyal to loved ones. Serene and adaptable, with no special exercise needs, Chows happily take to city life. The Chow Chow, an all-purpose dog of ancient China, presents the picture of a muscular, deep-chested aristocrat with an air of inscrutable timelessness. Dignified, serious-minded, and aloof, the Chow Chow is a breed of unique delights.",
		"popularity": 75,
		"min_height": 43.18,
		"max_height": 50.80,
		"min_weight": 20.41,
		"max_weight": 31.75,
		"min_expectancy": 8.00,
		"max_expectancy": 12.00,
		"embbeding": [0.60, 0.60, 0.60, 0.20, 0.40]
	},
	{
		"name": "Cocker Spaniel",
		"description": "Those big, dark eyes; that sweet expression; those long, lush ears that practically demand to be touched—no wonder the Cocker spent years as America’s most popular breed. The Cocker is the AKC’s smallest sporting spaniel, standing about 14 to 15 inches. The coat comes in enough colors and patterns to please any taste. The well-balanced body is sturdy and solid, and these quick, durable gundogs move with a smooth, easy gait.Cockers are eager playmates for kids and are easily trained as companions and athletes. They are big enough to be sporty, but compact enough to be portable. A Cocker in full coat rewards extra grooming time by being the prettiest dog on the block. These energetic sporting dogs love playtime and brisk walks. The merry and frolicsome Cocker Spaniel, with his big, dreamy eyes and impish personality, is one of the world’s best-loved breeds. They were developed as hunting dogs, but Cockers gained their wide popularity as all-around companions.",
		"popularity": 30,
		"min_height": 34.29,
		"max_height": 39.37,
		"min_weight": 9.07,
		"max_weight": 13.61,
		"min_expectancy": 10.00,
		"max_expectancy": 14.00,
		"embbeding": [0.80, 0.40, 0.60, 1.00, 1.00]
	},
	{
		"name": "Collie",
		"description": "The Collie is a large but lithe herder standing anywhere from 22 to 26 inches tall. The rough variety boasts one of the canine kingdom’s most impressively showy coats; the smooth coat’s charms are subtler but no less satisfying. Coat colors in both varieties are sable and white, tricolor, blue merle, or white. Collie fanciers take pride in their breed’s elegant wedge-shaped head, whose mobile ears and almond eyes convey a wide variety of expressions.Collies are famously fond of children and make wonderful family pets. These swift, athletic dogs thrive on companionship and regular exercise. With gentle training, they learn happily and rapidly. The Collie’s loyalty, intelligence, and sterling character are the stuff of legend. The majestic Collie, thanks to a hundred years as a pop-culture star, is among the world’s most recognizable and beloved dog breeds. The full-coated “rough” Collie is the more familiar variety, but there is also a sleek “smooth” Collie.",
		"popularity": 38,
		"min_height": 55.88,
		"max_height": 66.04,
		"min_weight": 22.68,
		"max_weight": 34.02,
		"min_expectancy": 12.00,
		"max_expectancy": 14.00,
		"embbeding": [0.60, 0.60, 0.60, 0.80, 0.80]
	},
	{
		"name": "Dachshund",
		"description": "The word “icon” is terribly overworked, but the Dachshund—with his unmistakable long-backed body, little legs, and big personality—is truly an icon of purebred dogdom. Dachshunds can be standard-sized (usually 16 to 32 pounds) or miniature (11 pounds or under), and come in one of three coat types: smooth, wirehaired, or longhaired.Dachshunds aren’t built for distance running, leaping, or strenuous swimming, but otherwise these tireless hounds are game for anything. Smart and vigilant, with a big-dog bark, they make fine watchdogs. Bred to be an independent hunter of dangerous prey, they can be brave to the point of rashness, and a bit stubborn, but their endearing nature and unique look has won millions of hearts the world over. The famously long, low silhouette, ever-alert expression, and bold, vivacious personality of the Dachshund have made him a superstar of the canine kingdom. Dachshunds come in two sizes and in three coat types of various colors and patterns.",
		"popularity": 12,
		"min_height": 12.70,
		"max_height": 22.86,
		"min_weight": 4.99,
		"max_weight": 14.51,
		"min_expectancy": 12.00,
		"max_expectancy": 16.00,
		"embbeding": [0.40, 0.40, 0.60, 0.60, 0.60]
	},
	{
		"name": "Doberman Pinscher",
		"description": "Dobermans are compactly-built dogs—muscular, fast, and powerful—standing between 24 to 28 inches at the shoulder. The body is sleek but substantial, and is covered with a glistening coat of black, blue, red, or fawn, with rust markings. These elegant qualities, combined with a noble, wedge-shaped head and an easy, athletic way of moving have earned Dobermans a reputation as royalty in the canine kingdom. A well-conditioned Doberman on patrol will deter all but the most foolish intruder. Sleek and powerful, possessing both a magnificent physique and keen intelligence, the Doberman Pinscher is one of dogkind's noblemen. This incomparably fearless and vigilant breed stands proudly among the world's finest protection dogs.",
		"popularity": 17,
		"min_height": 60.96,
		"max_height": 71.12,
		"min_weight": 27.22,
		"max_weight": 45.36,
		"min_expectancy": 10.00,
		"max_expectancy": 12.00,
		"embbeding": [0.20, 0.80, 1.00, 1.00, 0.60]
	},
	{
		"name": "Dogo Argentino",
		"description": "The ideal Dogo Argentino is a study in harmony. He is large, powerful, and athletic. His strong head is supported by a thick, but elegant neck that connects to a balanced body, which is sustained by straight, substantial forelegs and very muscular, medium-angulated hindquarters. The Dogo gives the impression of explosive power and energy. Developed to find, chase and catch dangerous game the Dogo must have a good nose, great lung capacity, and a powerful, yet agile, muscular build. His expression is alert and intelligent, with a marked hardness. The Dogo is instantly identifiable by his short, completely white coat. The Dogo Argentino is a pack-hunting dog, bred for the pursuit of big-game such as wild boar and puma, and possesses the strength, intelligence and quick responsiveness of a serious athlete. His short, plain and smooth coat is completely white, but a dark patch near the eye is permitted as long as it doesn't cover more than 10% of the head.",
		"min_height": 60.96,
		"max_height": 67.31,
		"min_weight": 39.92,
		"max_weight": 45.36,
		"min_expectancy": 9.00,
		"max_expectancy": 15.00,
		"embbeding": [0.20, 0.20, 1.00]
	},
	{
		"name": "French Bulldog",
		"description": "The French Bulldog resembles a Bulldog in miniature, except for the large, erect “bat ears” that are the breed’s trademark feature. The head is large and square, with heavy wrinkles rolled above the extremely short nose. The body beneath the smooth, brilliant coat is compact and muscular.The bright, affectionate Frenchie is a charmer. Dogs of few words, Frenchies don’t bark much—but their alertness makes them excellent watchdogs. They happily adapt to life with singles, couples, or families, and do not require a lot of outdoor exercise. They get on well with other animals and enjoy making new friends of the human variety. It is no wonder that city folk from Paris to Peoria swear by this vastly amusing and companionable breed. The one-of-a-kind French Bulldog, with his large bat ears and even disposition, is one of the world’s most popular small-dog breeds, especially among city dwellers. The Frenchie is playful, alert, adaptable, and completely irresistible.",
		"popularity": 4,
		"min_height": 27.94,
		"max_height": 33.02,
		"min_weight": 12.70,
		"max_weight": 12.70,
		"min_expectancy": 10.00,
		"max_expectancy": 12.00,
		"embbeding": [0.20, 0.80, 0.40, 0.60, 0.60]
	},
	{
		"name": "Golden Retriever",
		"description": "The Golden Retriever is a sturdy, muscular dog of medium size, famous for the dense, lustrous coat of gold that gives the breed its name. The broad head, with its friendly and intelligent eyes, short ears, and straight muzzle, is a breed hallmark. In motion, Goldens move with a smooth, powerful gait, and the feathery tail is carried, as breed fanciers say, with a “merry action.”The most complete records of the development of the Golden Retriever are included in the record books that were kept from 1835 until about 1890 by the gamekeepers at the Guisachan (pronounced Gooeesicun) estate of Lord Tweedmouth at Inverness-Shire, Scotland. These records were released to public notice in Country Life in 1952, when Lord Tweedmouth’s great-nephew, the sixth Earl of Ilchester, historian and sportsman, published material that had been left by his ancestor. They provided factual confirmation to the stories that had been handed down through generations.Goldens are outgoing, trustworthy, and eager-to-please family dogs, and relatively easy to train. They take a joyous and playful approach to life and maintain this puppyish behavior into adulthood. These energetic, powerful gundogs enjoy outdoor play. For a breed built to retrieve waterfowl for hours on end, swimming and fetching are natural pastimes. The Golden Retriever, an exuberant Scottish gundog of great beauty, stands among America’s most popular dog breeds. They are serious workers at hunting and field work, as guides for the blind, and in search-and-rescue, enjoy obedience and other competitive events, and have an endearing love of life when not at work.",
		"popularity": 3,
		"min_height": 54.61,
		"max_height": 60.96,
		"min_weight": 24.95,
		"max_weight": 34.02,
		"min_expectancy": 10.00,
		"max_expectancy": 12.00,
		"embbeding": [0.40, 0.60, 1.00, 1.00, 0.80]
	},
	{
		"name": "Havanese",
		"description": "Distinctive features of the Havanese include a curled-over tail and a gorgeous silky coat, which comes in a variety of colors. Some owners enjoy cording the coat, in the manner of a Puli, and others clip it short to reduce grooming time. Happily, Havenese are just as cute no matter what hairdo you give them.Their small but sturdy bodies, adaptable nature, and social skills make Havanese an ideal city dog, but they are content to be anywhere that they can command the attention of admirers young and old alike. Havanese, smart and trainable extroverts with the comic instincts of a born clown, are natural trick dogs. Havanese are also excellent watchdogs and take the job seriously, but will usually keep the barking to a minimum. Havanese, the only dog breed native to Cuba, are cheerful little dogs with a spring in their step and a gleam in their big, brown eyes. These vivacious and sociable companions are becoming especially popular with American city dwellers.",
		"popularity": 24,
		"min_height": 21.59,
		"max_height": 29.21,
		"min_weight": 3.18,
		"max_weight": 5.90,
		"min_expectancy": 14.00,
		"max_expectancy": 16.00,
		"embbeding": [0.60, 0.40, 0.60, 0.80, 1.00]
	},
	{
		"name": "Italian Greyhound",
		"description": "IGs are Greyhounds in miniature—more slender, but a Greyhound’s equal in grace and elegance. Standing ideally 13 to 15 inches at the shoulder, they present the sleek, curving lines common to all coursing hounds. Distinguishing features are the long, fine-boned legs.IGs combine the attentiveness of lapdogs with the complexity of ancient, aristocratic hounds. Bred for centuries to be doting companions and jesters, these high-stepping charmers refuse to be ignored. “On the whole,” writes an IG expert, “the breed would much rather be in your lap or bed than on the floor.” They are, though, true sighthounds and will bolt after quick-moving prey at the drop of a cat. A short-coat, low-fat breed, IGs require extra care in cold weather A true Greyhound in miniature, the elegant Italian Greyhound is an alert, playful, and highly affectionate toy companion. IGs make decorative couch dogs, but at heart they are flash-and-dash coursing hounds with an instinct for pursuit.",
		"popularity": 73,
		"min_height": 33.02,
		"max_height": 38.10,
		"min_weight": 3.18,
		"max_weight": 6.35,
		"min_expectancy": 14.00,
		"max_expectancy": 15.00,
		"embbeding": [0.20, 0.60, 0.60, 0.40, 0.20]
	},
	{
		"name": "Labrador Retriever",
		"description": "The sturdy, well-balanced Labrador Retriever can, depending on the sex, stand from 21.5 to 24.5 inches at the shoulder and weigh between 55 to 80 pounds. The dense, hard coat comes in yellow, black, and a luscious chocolate. The head is wide, the eyes glimmer with kindliness, and the thick, tapering “otter tail” seems to be forever signaling the breed’s innate eagerness.Labs are famously friendly. They are companionable housemates who bond with the whole family, and they socialize well with neighbor dogs and humans alike. But don’t mistake his easygoing personality for low energy: The Lab is an enthusiastic athlete that requires lots of exercise, like swimming and marathon games of fetch, to keep physically and mentally fit. The sweet-faced, lovable Labrador Retriever is America’s most popular dog breed. Labs are friendly, outgoing, and high-spirited companions who have more than enough affection to go around for a family looking for a medium-to-large dog.",
		"min_height": 54.61,
		"max_height": 62.23,
		"min_weight": 24.95,
		"max_weight": 36.29,
		"min_expectancy": 10.00,
		"max_expectancy": 12.00,
		"embbeding": [1, 0.40, 0.80, 1.00, 1.00, 1.00]
	},
	{
		"name": "Maltese",
		"description": "Maltese are affectionate toy dogs weighing less than seven pounds, covered by a long, straight, silky coat. Beneath the all-white mantle is a compact body moving with a smooth and effortless gait. The overall picture depicts free-flowing elegance and balance. The irresistible Maltese face—with its big, dark eyes and black gumdrop nose—can conquer the most jaded sensibility.Despite their aristocratic bearing, Maltese are hardy and adaptable pets. They make alert watchdogs who are fearless in a charming toy-dog way, and they are game little athletes on the agility course. Maltese are low-shedding, long-lived, and happy to make new friends of all ages. Sometimes stubborn and willful, they respond well to rewards-based training. The tiny Maltese, “Ye Ancient Dogge of Malta,” has been sitting in the lap of luxury since the Bible was a work in progress. Famous for their show-stopping, floor-length coat, Maltese are playful, charming, and adaptable toy companions.",
		"popularity": 37,
		"min_height": 17.78,
		"max_height": 22.86,
		"min_weight": 3.18,
		"max_weight": 3.18,
		"min_expectancy": 12.00,
		"max_expectancy": 15.00,
		"embbeding": [0.80, 0.20, 0.60, 0.60, 1.00]
	},
	{
		"name": "Mastiff",
		"description": "For the uninitiated, a face-to-face encounter with these black-masked giants can be startling. A male stands at least 30 inches at the shoulder and can outweigh many a full-grown man. The rectangular body is deep and thickly muscled, covered by a short double coat of fawn, apricot, or brindle stripes. The head is broad and massive, and a wrinkled forehead accentuates an alert, kindly expression. Mastiffs are patient, lovable companions and guardians who take best to gentle training. Eternally loyal Mastiffs are protective of family, and a natural wariness of strangers makes early training and socialization essential. Mastiffs are magnificent pets, but acquiring a powerful giant-breed dog is commitment not to be taken lightly. The colossal Mastiff belongs to a canine clan as ancient as civilization itself. A massive, heavy-boned dog of courage and prodigious strength, the Mastiff is docile and dignified but also a formidable protector of those they hold dear.",
		"popularity": 29,
		"min_height": 69.85,
		"max_height": 76.20,
		"min_weight": 54.43,
		"max_weight": 104.33,
		"min_expectancy": 6.00,
		"max_expectancy": 10.00,
		"embbeding": [0.20, 0.40, 0.60, 0.60, 0.60]
	},
	{
		"name": "Mudi",
		"description": "The Mudi (pronounced “moodie”) is a medium-sized herding dog from Hungary which has been in existence since the 19th century. It is said the Mudi evolved naturally from crosses of the Puli, Pumi and German Spitz breeds. Today, the Mudi, though very rare, is seen as an active, intelligent, biddable working breed. It is estimated there are no more than a few thousand Mudi worldwide, with the greatest numbers being in Hungary, followed by Finland, and then even scarcer throughout Europe, the U.S, and Canada. The Mudi excels at agility, obedience, and flyball, as well as other dog sports. He is a true working breed and shines when herding both cattle and sheep, and has found fame as a search and rescue dog in both Finland and the U.S. Club Contact DetailsClub: Mudi Club of AmericaName: Susanne AndersonEmail: sande2404@gmail.com The Mudi is an extremely versatile, intelligent, alert, agile, all-purpose Hungarian farm dog. His courage is useful for working the most stubborn livestock. The breed is a loyal protector of property and family members without being overly aggressive.",
		"min_height": 38.10,
		"max_height": 46.99,
		"min_weight": 8.16,
		"max_weight": 13.15,
		"min_expectancy": 12.00,
		"max_expectancy": 14.00,
		"embbeding": [0.20, 0.40, 1.00, 1.00, 0.40]
	},
	{
		"name": "Pembroke Welsh Corgi",
		"description": "At 10 to 12 inches at the shoulder and 27 to 30 pounds, a well-built male Pembroke presents a big dog in a small package. Short but powerful legs, muscular thighs, and a deep chest equip him for a hard day’s work. Built long and low, Pembrokes are surprisingly quick and agile. They can be red, sable, fawn, and black and tan, with or without white markings.The Pembroke is a bright, sensitive dog who enjoys play with his human family and responds well to training. As herders bred to move cattle, they are fearless and independent. They are vigilant watchdogs, with acute senses and a “big dog” bark. Families who can meet their bold but kindly Pembroke’s need for activity and togetherness will never have a more loyal, loving pet. Among the most agreeable of all small housedogs, the Pembroke Welsh Corgi is a strong, athletic, and lively little herder who is affectionate and companionable without being needy. They are one of the world's most popular herding breeds.",
		"popularity": 13,
		"min_height": 25.40,
		"max_height": 30.48,
		"min_weight": 12.70,
		"max_weight": 13.61,
		"min_expectancy": 12.00,
		"max_expectancy": 13.00,
		"embbeding": [0.40, 0.80, 0.80, 0.60, 1.00]
	},
	{
		"name": "Pomeranian",
		"description": "The Pomeranian combines a tiny body (no more than seven pounds) and a commanding big-dog demeanor. The abundant double coat, with its frill extending over the chest and shoulders, comes in almost two dozen colors, and various patterns and markings, but is most commonly seen in orange or red.Alert and intelligent, Pomeranians are easily trained and make fine watchdogs and perky pets for families with children old enough to know the difference between a toy dog and a toy. Poms are active but can be exercised with indoor play and short walks, so they are content in both the city and suburbs. They will master tricks and games with ease, though their favorite activity is providing laughs and companionship to their special human. The tiny Pomeranian, long a favorite of royals and commoners alike, has been called the ideal companion. The glorious coat, smiling, foxy face, and vivacious personality have helped make the Pom one of the world's most popular toy breeds.",
		"popularity": 23,
		"min_height": 15.24,
		"max_height": 17.78,
		"min_weight": 1.36,
		"max_weight": 3.18,
		"min_expectancy": 12.00,
		"max_expectancy": 16.00,
		"embbeding": [0.60, 0.60, 0.60, 0.60, 0.60]
	},
	{
		"name": "Poodle (Miniature)",
		"description": "Poodles come in three size varieties: Standards should be more than 15 inches tall at the shoulder; Miniatures are 15 inches or under; Toys stand no more than 10 inches. All three varieties have the same build and proportions. At dog shows, Poodles are usually seen in the elaborate Continental Clip. Most pet owners prefer the simpler Sporting Clip, in which the coat is shorn to follow the outline of the squarely built, smoothly muscled body.Forget those old stereotypes of Poodles as sissy dogs. Poodles are eager, athletic, and wickedly smart “real dogs” of remarkable versatility. The Standard, with his greater size and strength, is the best all-around athlete of the family, but all Poodles can be trained with great success. Whether Standard, Miniature, or Toy, and either black, white, or apricot, the Poodle stands proudly among dogdom’s true aristocrats. Beneath the curly, low-allergen coat is an elegant athlete and companion for all reasons and seasons.",
		"popularity": 7,
		"min_height": 25.40,
		"max_height": 38.10,
		"min_weight": 4.54,
		"max_weight": 6.80,
		"min_expectancy": 10.00,
		"max_expectancy": 18.00,
		"embbeding": []
	},
	{
		"name": "Poodle (Standard)",
		"description": "Poodles come in three size varieties: Standards should be more than 15 inches tall at the shoulder; Miniatures are 15 inches or under; Toys stand no more than 10 inches. All three varieties have the same build and proportions. At dog shows, Poodles are usually seen in the elaborate Continental Clip. Most pet owners prefer the simpler Sporting Clip, in which the coat is shorn to follow the outline of the squarely built, smoothly muscled body.Forget those old stereotypes of Poodles as sissy dogs. Poodles are eager, athletic, and wickedly smart “real dogs” of remarkable versatility. The Standard, with his greater size and strength, is the best all-around athlete of the family, but all Poodles can be trained with great success. Whether Standard, Miniature, or Toy, and either black, white, or apricot, the Poodle stands proudly among dogdom’s true aristocrats. Beneath the curly, low-allergen coat is an elegant athlete and companion for all reasons and seasons.",
		"popularity": 7,
		"min_height": 38.10,
		"max_height": 38.10,
		"min_weight": 18.14,
		"max_weight": 31.75,
		"min_expectancy": 10.00,
		"max_expectancy": 18.00,
		"embbeding": [1.00, 0.20, 0.60, 1.00, 0.80]
	},
	{
		"name": "Poodle (Toy)",
		"description": "Poodles come in three size varieties: Standards should be more than 15 inches tall at the shoulder; Miniatures are 15 inches or under; Toys stand no more than 10 inches. All three varieties have the same build and proportions. At dog shows, Poodles are usually seen in the elaborate Continental Clip. Most pet owners prefer the simpler Sporting Clip, in which the coat is shorn to follow the outline of the squarely built, smoothly muscled body.Forget those old stereotypes of Poodles as sissy dogs. Poodles are eager, athletic, and wickedly smart “real dogs” of remarkable versatility. With an abundance of steady character and intelligence, the Toy Poodle is a “person” and expects to be treated like one. Despite his diminutive size, the Toy Poodle stands proudly among dogdom’s true aristocrats. Beneath the curly, low-allergen coat is an elegant athlete and companion for all reasons and seasons.",
		"popularity": 7,
		"min_height": 25.40,
		"max_height": 25.40,
		"min_weight": 1.81,
		"max_weight": 2.72,
		"min_expectancy": 10.00,
		"max_expectancy": 18.00,
		"embbeding": [1.00, 0.20, 0.60, 1.00, 0.80]
	},
	{
		"name": "Pug",
		"description": "The Pug’s motto is the Latin phrase “multum in parvo” (a lot in a little)—an apt description of this small but muscular breed. They come in three colors: silver or apricot-fawn with a black face mask, or all black. The large round head, the big, sparkling eyes, and the wrinkled brow give Pugs a range of human-like expressions—surprise, happiness, curiosity—that have delighted owners for centuries.Pug owners say their breed is the ideal house dog. Pugs are happy in the city or country, with kids or old folks, as an only pet or in a pack. They enjoy their food, and care must be taken to keep them trim. They do best in moderate climates—not too hot, not too cold—but, with proper care, Pugs can be their adorable selves anywhere. Once the mischievous companion of Chinese emperors, and later the mascot of Holland’s royal House of Orange, the small but solid Pug is today adored by his millions of fans around the world. Pugs live to love and to be loved in return.",
		"popularity": 28,
		"min_height": 25.40,
		"max_height": 33.02,
		"min_weight": 6.35,
		"max_weight": 8.16,
		"min_expectancy": 13.00,
		"max_expectancy": 15.00,
		"embbeding": [0.40, 0.80, 0.60, 0.60, 0.80]
	},
	{
		"name": "Rottweiler",
		"description": "A male Rottweiler will stand anywhere from 24 to 27 muscular inches at the shoulder; females run a bit smaller and lighter. The glistening, short black coat with smart rust markings add to the picture of imposing strength. A thickly muscled hindquarters powers the Rottie’s effortless trotting gait.A well-bred and properly raised Rottie will be calm and confident, courageous but not unduly aggressive. The aloof demeanor these world-class guardians present to outsiders belies the playfulness, and downright silliness, that endear Rotties to their loved ones. (No one told the Rottie he’s not a toy breed, so he is liable plop onto your lap for a cuddle.) Early training and socialization will harness a Rottie’s territorial instincts in a positive way. The Rottweiler is a robust working breed of great strength descended from the mastiffs of the Roman legions. A gentle playmate and protector within the family circle, the Rottie observes the outside world with a self-assured aloofness.",
		"popularity": 8,
		"min_height": 55.88,
		"max_height": 68.58,
		"min_weight": 36.29,
		"max_weight": 61.23,
		"min_expectancy": 9.00,
		"max_expectancy": 10.00,
		"embbeding": [0.40, 0.60, 0.60, 0.60, 0.40]
	},
	{
		"name": "Saint Bernard",
		"description": "Not ranked particularly high in AKC registrations, this genial giant is nonetheless among the world’s most famous and beloved breeds. The Saint’s written standard abounds with phrases like “very powerful,” “extraordinarily muscular,” “imposing,” and “massive.” A male stands a minimum 27.5 inches at the shoulder; females will be smaller and more delicately built. The huge head features a wrinkled brow, a short muzzle, and dark eyes, combining to give Saints the intelligent, friendly expression that was such a welcome sight to stranded Alpine travelers. The Saint Bernard does not rank very high in AKC registrations, but the genial giant of the Swiss Alps is nonetheless among the world’s most famous and beloved breeds. Saints are famously watchful, patient, and careful with children.",
		"popularity": 48,
		"min_height": 66.04,
		"max_height": 76.20,
		"min_weight": 54.43,
		"max_weight": 81.65,
		"min_expectancy": 8.00,
		"max_expectancy": 10.00,
		"embbeding": [0.40, 0.60, 0.60, 0.60, 0.80]
	},
	{
		"name": "Shetland Sheepdog",
		"description": "The Shetland Sheepdog is a small, active, and agile herding dog standing between 13 and 16 inches at the shoulder. The long coat is harsh and straight, with a dense undercoat, and comes in black, blue merle, and sable, with white markings. The coat, along with a long, wedge-shaped head; small, three-quarter erect ears; and deep-chested, level-backed torso, give Shelties the look of a rough-coated Collie in miniature.Bright and eager Shelties are easy trainers and world-class competitors in obedience, agility, and herding trials. They are sensitive and affectionate family dogs, highly in tune with the mood of the household. They like to bark and tend to be reserved toward strangers—two qualifications of an excellent watchdog. The Shetland Sheepdog, also known as the Sheltie, is an extremely intelligent, quick, and obedient herder from Scotland’s remote and rugged Shetland Islands. Shelties bear a strong family resemblance to their bigger cousin, the Collie.",
		"popularity": 25,
		"min_height": 33.02,
		"max_height": 40.64,
		"min_weight": 6.80,
		"max_weight": 11.34,
		"min_expectancy": 12.00,
		"max_expectancy": 14.00,
		"embbeding": [0.60, 0.60, 0.60, 1.00, 0.40]
	},
	{
		"name": "Shiba Inu",
		"description": "Brought to America from Japan as recently as 60 years ago, Shibas are growing in popularity in the West and are already the most popular breed in their homeland. Their white markings combined with their coloring (red, red sesame, or black and tan) and their alert expression and smooth stride makes them almost foxlike. They’re sturdy, muscular dogs with a bold, confident personality to match. An ancient Japanese breed, the Shiba Inu is a little but well-muscled dog once employed as a hunter. Today, the spirited, good-natured Shiba is the most popular companion dog in Japan. The adaptable Shiba is at home in town or country.",
		"popularity": 44,
		"min_height": 34.29,
		"max_height": 41.91,
		"min_weight": 7.71,
		"max_weight": 10.43,
		"min_expectancy": 13.00,
		"max_expectancy": 16.00,
		"embbeding": [0.40, 0.60, 0.60, 0.40, 0.40]
	},
	{
		"name": "Shih Tzu",
		"description": "Shih Tzu (pronounced in the West “sheed-zoo” or “sheet-su”; the Chinese say “sher-zer”), weighing between 9 to 16 pounds, and standing between 8 and 11 inches, are surprisingly solid for dogs their size. The coat, which comes in many colors, is worth the time you will put into it—few dogs are as beautiful as a well-groomed Shih Tzu.Being cute is a way of life for this lively charmer. The Shih Tzu is known to be especially affectionate with children. As a small dog bred to spend most of their day inside royal palaces, they make a great pet if you live in an apartment or lack a big backyard. Some dogs live to dig holes and chase cats, but a Shih Tzu’s idea of fun is sitting in your lap acting adorable as you try to watch TV. That face! Those big dark eyes looking up at you with that sweet expression! It’s no surprise that Shih Tzu owners have been so delighted with this little “Lion Dog” for a thousand years. Where Shih Tzu go, giggles and mischief follow.",
		"popularity": 20,
		"min_height": 22.86,
		"max_height": 26.67,
		"min_weight": 4.08,
		"max_weight": 7.26,
		"min_expectancy": 10.00,
		"max_expectancy": 18.00,
		"embbeding": [0.80, 0.20, 0.60, 0.60, 0.80]
	},
	{
		"name": "Whippet",
		"description": "At somewhere between 18 and 22 inches at the shoulder, the Whippet looks like a Greyhound, but smaller. The Whippet exhibits the classic “inverted S” lines of the sighthound. The deep chest and trim waist; a lean head supported by a long, arched neck; and slim but sturdy legs combine in a picture of an agile, fleet-footed athlete.Between bursts of intense pursuit, Whippets love to stretch out and relax for long hours, enjoying the role of a loving, and loved, companion. Whippets like a fenced yard to run in, but they do nicely in cozy apartments too—as long as they are exercised properly. Another plus for city dwellers: Whippets rarely bark. Despite the breed’s elegant looks, the Whippet is a robust, low-maintenance dog. The sleek, sweet-faced Whippet, the “Poor Man’s Racehorse,” is lightning quick. He is an amiable, dignified, and gentle soul, but give him something to chase and he’s all business. The name Whippet is synonymous with streamlined grace.",
		"popularity": 61,
		"min_height": 45.72,
		"max_height": 55.88,
		"min_weight": 11.34,
		"max_weight": 18.14,
		"min_expectancy": 12.00,
		"max_expectancy": 15.00,
		"embbeding": [0.20, 0.40, 0.60, 0.40, 0.40]
	},
	{
		"name": "Yorkshire Terrier",
		"description": "The Yorkshire Terrier is a compact, toy-size terrier of no more than seven pounds whose crowning glory is a floor-length, silky coat of steel blue and a rich golden tan.Don’t let the Yorkie’s daintiness fool you. Tenacious, feisty, brave, and sometimes bossy, the Yorkie exhibits all the traits of a true terrier. Often named the most popular dog breed in various American cities, Yorkies pack lots of big-town attitude into a small but self-important package. They are favorites of urbanites the world over.Yorkies are long-lived and low-allergen (the coat is more like human hair than animal fur), and they make fine little watchdogs. This is a true “personality breed,” providing years of laughs, love, and close companionship. Beneath the dainty, glossy, floor-length coat of a Yorkshire Terrier beats the heart of a feisty, old-time terrier. Yorkies earned their living as ratters in mines and mills long before they became the beribboned lapdogs of Victorian ladies.",
		"popularity": 10,
		"min_height": 17.78,
		"max_height": 20.32,
		"min_weight": 3.18,
		"max_weight": 3.18,
		"min_expectancy": 11.00,
		"max_expectancy": 15.00,
		"embbeding": [1.00, 0.20, 0.60, 0.20, 0.80]
	}
]
